{
    "version": "https://jsonfeed.org/version/1",
    "title": "Garrett Dowd",
    "description": "",
    "home_page_url": "https://blog.garrettdowd.com",
    "feed_url": "https://blog.garrettdowd.com/feed.json",
    "user_comment": "",
    "icon": "https://blog.garrettdowd.com/media/website/Garrett-Dowd-SF-2-01-svg.svg",
    "author": {
        "name": "Garrett Dowd"
    },
    "items": [
        {
            "id": "https://blog.garrettdowd.com/autonomous-vehicles-will-fail-without-this-technology/",
            "url": "https://blog.garrettdowd.com/autonomous-vehicles-will-fail-without-this-technology/",
            "title": "Autonomous Vehicles Will Fail Without This Technology",
            "summary": "Houston, we have a problemAnts, bees, and humans. All three of these animals form highly collaborative networks that allow them&hellip;",
            "content_html": "<h2>Houston, we have a problem</h2>\n<p><strong>Ants, bees, and humans.</strong> All three of these animals form highly collaborative networks that allow them to improve the efficiency of food foraging or reprimand a foolish driver ðŸ¤¬. In fact, almost every example of complex networks in nature rely on this one thing that self-driving cars can not do...</p>\n<p><strong>Communicate.Â </strong></p>\n<p>If you are from the transport industry or work on autonomous vehicles you may be rolling your eyes at the moment ðŸ™„. Communication in transportation has been on the development board for a LONG time. The U.S. government reserved spectrum in the 5.9GHz frequency range for vehicular use back in 1999 (<a href=\"https://docs.fcc.gov/public/attachments/FCC-99-305A1.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">FCC 99-305</a>)!!! Even with developed standards like IEEE 802.11p and SAE J2735 and a proposed mandate of DSRC radios from USDOT in 2016, vehicle to anything (V2X) communication has failed to make a significant impact in transportation for reasons beyond the scope of this article.</p>\n<p>However, in the last ten years machine learning and improved computing power has led to huge leaps in autonomous vehicle development. According to some estimates, <a href=\"https://www.brookings.edu/research/gauging-investment-in-self-driving-cars/\" target=\"_blank\" rel=\"noopener noreferrer\">more than eighty billion dollars</a> has been dedicated to the pursuit of self driving cars. With so much to loose and even more to gain, the autonomous vehicle industry is highly competitive and resources are carefully allocated. V2X is nowhere near the top of the priority list, but it should be.</p>\n<p class=\"msg msg--highlight \"><strong>In nature and in aviation, communication is a defining safety and optimization technology. V2X is poised to improve autonomous vehicle safety, but serious challenges exist. </strong></p>\n<p>This opinion piece will further explore <span style=\"text-decoration: underline;\">why communication is important</span> and what <span style=\"text-decoration: underline;\">challenges</span> stand in the way of progress.</p>\n<h2>Why communication is important.</h2>\n<p>Bio-mimicry has been one of the most interesting areas of scientific study and engineering design in the past decade. In machine learning, neural networks are based on the understanding of how human brains work and have led to immense gains in the practicality and use of machine learning techniques. Without neural networks, self-driving cars as we know them today would not exist.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://media.npr.org/assets/img/2015/01/16/istock_000041703624large_wide-61304d12b42f1c346b2344039f6c2f294692699e.jpg?s=1400\" data-is-external-image=\"true\"  alt=\"\" width=\"534\" height=\"300\"></figure>\n<p>Bio-mimicry has also made its way into other engineering domains such as control systems and traffic management. Researchers have studied everything from bee foraging methods to ant colony traffic to design autonomous intersection management and cooperative cruise control (platoon) algorithms. These algorithms fundamentally rely on inter-vehicle communication. This is less sci-fi fantasy and more of an everyday occurrence than you might think.</p>\n<p>Four-way stops? Pedestrian crossings? The reality is that we use more than just our brake lights and indicators to signal our intent. Autonomous vehicle companies have recognized this for a long time and modified vehicle controls to more closely mimic human driving behaviors. However, this method of communication or \"language\" is neither standardized nor inherently safe.</p>\n<p>Ask the U.S. Federal Aviation Agency or any other international aviation agency about the importance of clear and precise communication. Even in the wide open space above our heads, communication (ADS-B and voice) is necessary to ensure safety.</p>\n<p class=\"msg msg--highlight \"><strong>In other words, aviation industry investments in communication have led to measurable safety improvements.</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://img.militaryaerospace.com/files/base/ebm/mae/image/2020/05/16x9/ATC_market_11_May_2020.5eb5484d57cb1.png?auto=format&amp;fit=max&amp;w=1200\" data-is-external-image=\"true\"  alt=\"\" width=\"551\" height=\"310\"></figure>\n<p>There is a plethora of evidence from both nature and other transportation industries that communication is a key component to safety and optimization. However, communication has yet to find its place in ground transportation.</p>\n<h2>Challenges</h2>\n<p>As mentioned in the introduction, there has been little progress in ground transportation communication given the 20+ year history of the industry. The current state of the U.S. industry is raveled in indecision. If we want to unlock the full potential of communication for ground transportation we need to tackle some big challenges.</p>\n<p>When ITS and DSRC concepts were developed in the 1990's and 2000's, autonomous vehicles were a gutter dream. Cars were human driven AND owned. While DSRC could have improved overall public safety, there was little market incentive for vehicle manufacturers to justify R&amp;D costs. The government stepped in (as it should have) to fund research, technology, and standards. Even with government support, market incentive did not develop.</p>\n<p>Fast-forward to 2020 and autonomous vehicles completely change the paradigm.</p>\n<ol>\n<li>AVs rely on data from sensors\n<ol>\n<li>AVs rely on a multitude of sensors that are error-prone in certain circumstances. LiDARs do not like snow and rain, cameras hate glare from direct sunlight. Each sensor has a failure mode, so a range of sensor types helps to reduce the number of complete failure modes. Communication offers information rich data that can supplement existing sensors (blind corners, vehicles trajectories, etc).</li>\n</ol>\n</li>\n<li>AVs are expected to be company owned/operated\n<ol>\n<li>Safety will no longer be sold on a sticker (<a href=\"https://en.wikipedia.org/wiki/New_Car_Assessment_Program\" target=\"_blank\" rel=\"noopener noreferrer\">see NCAP</a>), so AV developers and transportation providers will be required to maintain incredibly high safety standards. There is clear economic motivation to invest in technology that measurably improves safety (rather than measures of safety that sell cars).</li>\n</ol>\n</li>\n</ol>\n<p>So why are AV companies not devoting resources to communication efforts?Â </p>\n<h3>Egg or Chicken</h3>\n<p>Language is only useful if other people understand it. So how do you start a language? Similarly, a two-sided market like Uber is only useful if there are both drivers and riders. Two-sided markets rely on network effects, which are now a core principle in many digital businesses. While there may be a company using network effects to build an \"Airbnb for pets\", no one has fully solved the two-sided market style challenges for V2X.</p>\n<p>However, a crack is developing. Telematics is already an important/standard part of autonomous vehicles system for monitoring and dispatch. Cellular V2X standards are in the process of being developed that would make V2X integration a negligible cost. The question is, how do you bring the other side of the market to the table? Human driven cars are not disappearing anytime too soon. Cities are becoming more pedestrian centric. Road work will continue to be an entire season in Michigan.Â </p>\n<h3>Security</h3>\n<p>As with any cyber-physical system, malicious hacking could cause serious physical destruction. The good news is that communication security is a long studied field with great tools and processes; thank you world wide internet! The bad news is that there are still security challenges for decentralized, wireless, real-time communication networks.</p>\n<p>There may always be some vulnerability that we are willing to accept; e.g. interfering with GPS systems it relatively easy, but doing so will land you in federal prison for a long time. In any case, success of ground transport communication is inherently linked with improvements in security.</p>\n<h3>Technology</h3>\n<p>There is currently a silent battle taking place between DSRC (ITS-G5/IEEE 802.11p) and C-V2X (3GPP). DSRC is the incumbent technology that has been backed by government for more than a decade. C-V2X is a relatively new addition created by the mobile communication industry. C-V2X defines new/different physical and medium access control (MAC) layers. Qualcomm, a major manufacturer of wireless chips, describes C-V2X as having \"increased communication range (~2X), better non-line-of-sight (NLOS) performance, enhanced reliability, and cost efficiency\" when compared to DSRC. However, it is not that simple. <a href=\"increased communication range (~2X), better non-line-of-sight (NLOS) performance, enhanced reliability, and cost efficiency\" target=\"_blank\" rel=\"noopener noreferrer\">A recent paper published in the 2019 IEEE VTC</a> shows that C-V2X under-performs DSRC in high vehicular density (urban) environments. There are pros and cons for both standards and the industry seems to be leaning towards a hybrid system. The reality is that technology adoption may depend on which use-case/implementation gains traction first.</p>\n<p>Â </p>\n<h2>Finding the Opportunity</h2>\n<p>Thanks for making it to this point in the article. There is a lot of opportunity waiting to be unlocked by self driving cars and vehicle communication technologies. However, it is difficult to make concrete assessments of this opportunity without the proper tools.</p>\n<p>Traffic simulation is a powerful tool that gives traffic engineers and urban planners a way to assess the potential impact of traffic pattern and infrastructure changes. However, there is no great way to simulate generalized connected vehicle use cases.</p>\n<p>This is why I created a <a href=\"https://github.com/garrettdowd/py_ptv\" target=\"_blank\" rel=\"noopener noreferrer\">Python library for PTV Vissim</a>, a leading traffic simulator, that makes it easier for researchers and engineers to simulate connected and automated vehicle use cases.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/30/pyptv.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/30/responsive/pyptv-xs.png 384w ,https://blog.garrettdowd.com/media/posts/30/responsive/pyptv-sm.png 600w ,https://blog.garrettdowd.com/media/posts/30/responsive/pyptv-md.png 768w ,https://blog.garrettdowd.com/media/posts/30/responsive/pyptv-lg.png 1200w\"  alt=\"\" width=\"494\" height=\"258\"></figure>\n<p>Learn more about simulating connected and autonomous vehicles in my next article. (coming mid-September)</p>\n<p><a href=\"#non-existing-post-with-id-10\" class=\"btn\">Simulating Autonomous Vehicles</a></p>\n<p>Â </p>",
            "image": "https://blog.garrettdowd.com/media/posts/30/960x0.jpg",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Transportation"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/designing-ufarm/",
            "url": "https://blog.garrettdowd.com/designing-ufarm/",
            "title": "uFarm | Product",
            "summary": "Growing your own food can be as simple as a plant in a glass of water. However, a glass of&hellip;",
            "content_html": "<p>Growing your own food can be as simple as a plant in a glass of water. However, a glass of water did not solve my food growing problems. So, I designed and built an automated, apartment-sized, aquaponic grow system that I released as an open-source project on Github. For the motivation behind this project check out my article, <a href=\"https://blog.garrettdowd.com/why-food-sucks/\">Why Food Sucks</a>.</p>\n<p>This is the first article in a series about the uFarm product design process. The series will delve into three distinct areas of the design process;</p>\n<ol>\n<li>Product | Building a useful product that actually solves problems.</li>\n<li><a href=\"#non-existing-post-with-id-26\">Aquaponics | Plant science turned into design parameters.</a> (Coming mid-September)</li>\n<li><a href=\"#non-existing-post-with-id-27\">Engineering | Iterative design of a cyber-physical system.</a> (Coming late September)</li>\n</ol>\n<p>The series will end with;</p>\n<ol>\n<li><a href=\"#non-existing-post-with-id-25\">Outcomes | Running and testing the prototype.</a></li>\n<li><a href=\"#non-existing-post-with-id-25\">Build Log | Pictures and comments from the process.</a></li>\n</ol>\n<h2 id=\"mcetoc_1eh0v94l53hj\">Social Impact Disclaimer</h2>\n<p>uFarm is built with the intent for social impact. It attempts to solve real user problems/pains in a way that tackles <a href=\"https://blog.garrettdowd.com/why-food-sucks/\">systemic problems with the food system</a>. In many ways it is a low cost experiment to assess the viability of a social startup.</p>\n<p>The organic movement is a good example of what uFarm is trying to achieve. Without the work of film makers and non-profits, consumers would have no reason to choose organic produce at the shop or eat at a farm to table restaurant. While the organic movement has become overly commercialized, it has at least moved the public to be more conscious of what they eat.</p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1eh0v94l53hj\">Social Impact Disclaimer</a></li>\n<li><a href=\"#mcetoc_1eh0v94l53hk\">Product</a>\n<ul>\n<li><a href=\"#mcetoc_1eh0v94l53hl\">Problems</a></li>\n<li><a href=\"#mcetoc_1eh0v94l63hm\">Users</a></li>\n<li><a href=\"#mcetoc_1eh0v94l63hn\">Business Environment</a>\n<ul>\n<li><a href=\"#mcetoc_1eh7uv3djft\">Competition</a></li>\n<li><a href=\"#mcetoc_1eh7uv3djfu\">Technology Trends</a></li>\n<li><a href=\"#mcetoc_1eh7uv3djfv\">Regulatory</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1eh0v94l63hr\">Product Specs</a></li>\n<li><a href=\"#mcetoc_1eh0v94l63ho\">Trade-offs</a>\n<ul>\n<li><a href=\"#mcetoc_1eh7q4ekdf6\">Aquaponic vs Nutrient Dosing</a></li>\n<li><a href=\"#mcetoc_1eh7q4ekdf7\">Size</a></li>\n<li><a href=\"#mcetoc_1eh7q4ekdf8\">Automation</a></li>\n<li><a href=\"#mcetoc_1eh7q4ekdf9\">Customizability vs Simplicity</a></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1eh0v94l53hk\">Product</h2>\n<p>What problems does uFarm solve? Who is it for? How is it strategically positioned? What features should be built first? These are all part of the product vision that inform engineering design choices. While uFarm is an experimental side project that is not meant to be commercialized, it is meant to have value. Product and user focused thinking helped me to test more valuable hypotheses with the initial uFarm prototype.</p>\n<h3 id=\"mcetoc_1eh0v94l53hl\">Problems</h3>\n<p>Taking startup methods cues from Steve Blank and Eric Ries, uFarm is based on a number of hypotheses about the problem, user, and solution. In my opinion, startups in the personal food growing space often fail because they do not identify painful problems. Rather, they create new problems including maintenance and living space clutter. uFarm is focused on common problems that are shared by anyone who cooks food at home.</p>\n<ol>\n<li><strong>Food spoilage</strong>\n<ol>\n<li>A surprising amount of food waste occurs because food portions sold at groceries are too large or because you didn't get around to making that basil pesto as soon as you had hoped. This is especially true for people that do not live with a partner or family.</li>\n</ol>\n</li>\n<li><strong>Time</strong>\n<ol>\n<li>It is taco night, how often have you forgotten the cilantro/corriander and had to take a quick run to the shop. Or, more realistically, you have taco supplies at home and there is no way that you are venturing outside of your house to buy fresh produce.</li>\n</ol>\n</li>\n<li><strong>Cannot purchase at grocer</strong>\n<ol>\n<li>For culinary enthusiasts it can be hard to find ethnic or regional varieties of herbs. Kaffir lime, curry leaves, holy/thai basil, birdseye chilis, and even lemongrass can be hard to find. Because these herbs are less popular they sit on shelves for longer periods and quickly loose their flavor and/or spoil before they make it into your mouth.</li>\n</ol>\n</li>\n<li><strong>Sustainability and production transparency</strong>\n<ol>\n<li>What you choose to eat has a large impact on the environment and people's lives. At the end of the day, certifications and labels like USDA Organic or Free-Trade Certified are ultimately stacks of paperwork that the consumer can neither view nor verify.</li>\n</ol>\n</li>\n</ol>\n<p>At a societal level there are additional problems. A quick overview of these problems were given from a system perspective in my article, <a href=\"https://blog.garrettdowd.com/why-food-sucks/\">Why Food Sucks</a>. However, I want to reframe these problems with a user perspective.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/21/The-Uncooked-Chicken0672925011499429947.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/21/responsive/The-Uncooked-Chicken0672925011499429947-xs.jpg 384w ,https://blog.garrettdowd.com/media/posts/21/responsive/The-Uncooked-Chicken0672925011499429947-sm.jpg 600w ,https://blog.garrettdowd.com/media/posts/21/responsive/The-Uncooked-Chicken0672925011499429947-md.jpg 768w ,https://blog.garrettdowd.com/media/posts/21/responsive/The-Uncooked-Chicken0672925011499429947-lg.jpg 1200w\"  alt=\"\" width=\"450\" height=\"292\"></figure>\n<ul>\n<li><strong>Cooking is hard</strong><br>\n<ul>\n<li>Not everyone is a Ferran Adria or a Nathan Myhrvold. Many American families no longer pass down a plethora of family recipes for daily consumption. There are too many \"influencer chefs\" that give garbage recipes and poor cooking techniques. Deciding on what to cook and knowing how to cook it is too large of a barrier for many, especially if what you cook tastes no better than your local Chipotle.</li>\n<li>It takes a lot of time to go and buy fresh ingredients, especially if you <a href=\"http://www.foodsystemprimer.org/food-and-nutrition/hunger-and-food-insecurity/\" target=\"_blank\" rel=\"noopener noreferrer\">live in a food desert</a>.</li>\n<li>It takes even more time to plan meals so that food does not spoil in your fridge.</li>\n</ul>\n</li>\n</ul>\n<p>Â </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/21/SSF17-6-IMG_3139-copy.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/21/responsive/SSF17-6-IMG_3139-copy-xs.jpg 384w ,https://blog.garrettdowd.com/media/posts/21/responsive/SSF17-6-IMG_3139-copy-sm.jpg 600w ,https://blog.garrettdowd.com/media/posts/21/responsive/SSF17-6-IMG_3139-copy-md.jpg 768w ,https://blog.garrettdowd.com/media/posts/21/responsive/SSF17-6-IMG_3139-copy-lg.jpg 1200w\"  alt=\"\" width=\"376\" height=\"282\"></figure>\n<ul>\n<li><strong>You are good at tasting for sugar, not nutrition</strong>\n<ul>\n<li>That delicious apple at your local grocer was probably in storage for eight or more months. During that time it lost most of its nutritional value and is now just a convenient ball of sugar water. But hey it still tastes good right?</li>\n<li>That pint of cherry tomatoes you just got, yeah it was picked before it was ripe and then artificially ripened with ethylene gas during transportation. It doesn't have the same nutritional value as tomatoes allowed to naturally ripen on the plant.</li>\n<li><a href=\"http://www.foodsystemprimer.org/food-and-nutrition/food-marketing-and-labeling/\" target=\"_blank\" rel=\"noopener noreferrer\">John Hopkins on the marketing and labeling of food</a></li>\n</ul>\n</li>\n</ul>\n<p>Â </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://www.copemanhealthcare.com/wp-content/uploads/2014/11/calls-for-restricting-unhealthy-food-marketing-to-children.jpg\" data-is-external-image=\"true\"  alt=\"\" width=\"450\" height=\"171\"></figure>\n<ul>\n<li><strong>No one taught me</strong>\n<ul>\n<li>Home economic classes have been killed off. Both parents have full time jobs. Food is bought in plastic containers. Potatoes grow on trees like tomatoes, right?</li>\n<li><a href=\"http://www.foodsystemprimer.org/food-and-nutrition/food-environments/\" target=\"_blank\" rel=\"noopener noreferrer\">How we eat is heavily influenced by family, friends, and society.</a></li>\n</ul>\n</li>\n</ul>\n<p>Â </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://www.smallfootprintfamily.com/wp-content/uploads/plastic-is-toxic.jpg\" data-is-external-image=\"true\"  alt=\"\" width=\"400\" height=\"279\"></figure>\n<ul>\n<li><strong>Out of sight, out of mind</strong>\n<ul>\n<li>The rain forest is being destroyed so you can eat your donuts and potato chips made with palm oil (often just listed as vegetable oil).</li>\n<li>Cattle farming. So many problems here from more deforestation to animal abuse.</li>\n<li>Human abuse. You really don't want to know how your tea and coffee is produced. It is quite ironic that American companies now support behavior which the Country fought against for independence, [cough] Boston Tea Party.</li>\n</ul>\n</li>\n</ul>\n<p>Wow. Those are a lot of problems. Hopefully the next sections are easier reads.</p>\n<hr>\n<h3 id=\"mcetoc_1eh0v94l63hm\">Users</h3>\n<p>Passion for an idea can easily lead to feature creep and a lack of user focus. If the product is socially important then everyone should use it right? While widespread adoption may be the goal for the greatest social impact, product success does not grow on trees. Again taking cues from the tech startup world, Geoffrey Moore and his book Crossing the Chasm offer a commonly used framework to think about user categories and market adoption. This section will focus on</p>\n<ol>\n<li>Innovators</li>\n<li>Early Adopters</li>\n</ol>\n<p>The ideal <strong>innovator</strong> is both a tech and plant geek. There aren't many of us. We have a broad understanding of electronics/computers and love to build rather than talk. Each of us are interesting in plants for different reasons. Some of us found a love for plants through food, some of us grew up working in gardens or on farms, and some just want to grow plants on spaceships for interstellar journeys. The innovator has an account on Github and uses it to try out projects that other people have created. The innovator is not worried about blowing a fuse or fixing a leak.</p>\n<p>The <strong>early adopter</strong> is not as technically literate. However, what they lack in technical skill they make up for in passion for fixing our food system. They are careful about what food they buy and who they buy it from. They attend their local farmers market and they probably have a small garden at home. They may subscribe to food philosophies such as veganism, but they understand that these philosophies are about principles and not about rules. They are looking to do more, but time is a limiting factor.</p>\n<hr>\n<h3 id=\"mcetoc_1eh0v94l63hn\">Business Environment</h3>\n<h4 id=\"mcetoc_1eh7uv3djft\">Competition</h4>\n<p>uFarm is not the first automated home grow system. <a href=\"https://www.kickstarter.com/projects/grove-ecosystem/grove-ecosystem-grow-fresh-food-in-your-home/\" target=\"_blank\" rel=\"noopener noreferrer\">Grove Ecosystem</a> is a failed startup that raised over $4M USD from high profiles investors like Tim Ferris in 2016. Grove struggled with manufacturing and seemed to fail at attracting early adopters. There are many smaller countertop aquaponic systems like <a href=\"https://ecobloom.se/\" target=\"_blank\" rel=\"noopener noreferrer\">EcoGarden</a> and <a href=\"https://www.aquasprouts.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Aquasprouts</a>, however these are extremely small and simple solutions that are more of a display piece than a useful tool. There are also automated grow boxes that rely on nutrient dosing such as <a href=\"https://www.grobo.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Grobo</a>, <a href=\"https://www.seedolab.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Seedo</a>, and <a href=\"https://www.getleaf.co/\" target=\"_blank\" rel=\"noopener noreferrer\">Leaf</a>. Most of the automated hydroponic systems focus on growing cannabis, which seems to be one of the only profitable target markets at the moment.</p>\n<p>There are very few open-source hydroponic projects. The most famous project is the <a href=\"https://www.nytimes.com/2020/05/13/business/media/mit-closes-food-computer-project.html\" target=\"_blank\" rel=\"noopener noreferrer\">publicly criticized and recently closed</a> OpenAg project at MIT which created the <a href=\"https://en.wikipedia.org/wiki/Open_Agriculture_Initiative\" target=\"_blank\" rel=\"noopener noreferrer\">Personal Food Computer</a>.Â </p>\n<p>There are also projects aimed at automating traditional soil culture such as <a href=\"https://farm.bot/\" target=\"_blank\" rel=\"noopener noreferrer\">Farmbot</a>, a personal favorite.Â </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/21/IMG_9400.JPG\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/21/responsive/IMG_9400-xs.JPG 384w ,https://blog.garrettdowd.com/media/posts/21/responsive/IMG_9400-sm.JPG 600w ,https://blog.garrettdowd.com/media/posts/21/responsive/IMG_9400-md.JPG 768w ,https://blog.garrettdowd.com/media/posts/21/responsive/IMG_9400-lg.JPG 1200w\"  alt=\"\" width=\"488\" height=\"325\"></figure>\n<p>Â </p>\n<p>People can also grow food in their backyard or on their windowsill, although many urban dwellers do not have either of those options. The figure below shows the options for growing food at home.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/21/Annotation-2020-09-02-133214.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/21/responsive/Annotation-2020-09-02-133214-xs.png 384w ,https://blog.garrettdowd.com/media/posts/21/responsive/Annotation-2020-09-02-133214-sm.png 600w ,https://blog.garrettdowd.com/media/posts/21/responsive/Annotation-2020-09-02-133214-md.png 768w ,https://blog.garrettdowd.com/media/posts/21/responsive/Annotation-2020-09-02-133214-lg.png 1200w\"  alt=\"\" width=\"436\" height=\"336\"></figure>\n<p>For a more detailed comparison of solutions for home growing take a look at the <a href=\"https://en.wikipedia.org/wiki/Blue_Ocean_Strategy\" target=\"_blank\" rel=\"noopener noreferrer\">Blue Ocean</a> style figure below.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/21/Annotation-2020-09-02-142236.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/21/responsive/Annotation-2020-09-02-142236-xs.png 384w ,https://blog.garrettdowd.com/media/posts/21/responsive/Annotation-2020-09-02-142236-sm.png 600w ,https://blog.garrettdowd.com/media/posts/21/responsive/Annotation-2020-09-02-142236-md.png 768w ,https://blog.garrettdowd.com/media/posts/21/responsive/Annotation-2020-09-02-142236-lg.png 1200w\"  alt=\"\" width=\"718\" height=\"398\"></figure>\n<h4 id=\"mcetoc_1eh7uv3djfu\">Technology Trends</h4>\n<p>uFarm relies on the success and further development of a few core technologies.</p>\n<ul>\n<li>Light Emitting Diodes | Hail <a href=\"https://en.wikipedia.org/wiki/Haitz%27s_law\" target=\"_blank\" rel=\"noopener noreferrer\">Haitz</a></li>\n<li>Sensors (pH, EC, DO, lux, etc) | Cost, robustness</li>\n<li>Cameras | Cost, wavelength</li>\n<li>Processors | <a href=\"https://en.wikipedia.org/wiki/Moore%27s_law\" target=\"_blank\" rel=\"noopener noreferrer\">Moore</a> please</li>\n<li>Web Tech | edge-computing and user interface capabilities</li>\n<li>Machine Learning | tools to automatically assess plant health problems</li>\n</ul>\n<h4 id=\"mcetoc_1eh7uv3djfv\">Regulatory</h4>\n<p>The regulatory environment is non-prohibitive and there are a number of legislative opportunities that would be extremely beneficial including;</p>\n<ul>\n<li>Environmental Protection, Carbon Tax</li>\n<li>Supply Chain Transparency</li>\n<li>Agricultural Chemical Use Restrictions</li>\n<li>Redistribution of agricultural subsidies to better support small/local farmers</li>\n</ul>\n<p>(more detail to be added)</p>\n<hr>\n<h3 id=\"mcetoc_1eh0v94l63hr\">Product Specs</h3>\n<p>While these aren't detailed product specs that would be used for Jira/Confluence, the following should give a good idea of how product design is prioritized. These product specs are for an MVP targeting innovators and do not represent the specs for the original prototype.</p>\n<ol>\n<li>Hardware\n<ol>\n<li>Footprint less than 10 ft2 or 1 m2</li>\n<li>Autonomous for a minimum of 1 month.</li>\n<li>Bimonthly maintenance/cleaning.</li>\n<li>Ability to grow any leafy green (vegetative growth)</li>\n<li>Production rate of 3 kilograms per month</li>\n<li>Off the shelf components, locally source-able</li>\n<li>Build time of 12 hours</li>\n<li>Limit tools to drill, saw, knife, wire stripper, and soldering pencil.</li>\n</ol>\n</li>\n<li>Software\n<ol>\n<li>Use existing open-source projects</li>\n<li>Extensible\n<ol>\n<li>Easily customize automation</li>\n<li>Integrate with smart home</li>\n<li>Community grow recipes</li>\n</ol>\n</li>\n<li>Remote Management</li>\n<li>One click install</li>\n</ol>\n</li>\n</ol>\n<hr>\n<h3 id=\"mcetoc_1eh0v94l63ho\">Trade-offs</h3>\n<p>At a system level, there are a number of major decisions to make, each with their own (and sometimes coupled) trade-offs.</p>\n<h4 id=\"mcetoc_1eh7q4ekdf6\">Aquaponic vs Nutrient Dosing</h4>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 50%;\">Pros</td>\n<td style=\"width: 50%;\">Cons</td>\n</tr>\n<tr>\n<td style=\"width: 50%;\">\n<ul>\n<li>Aquaponics is inherently more stable (pH, nutrients), reducing the chance of plant death</li>\n<li>Nutrient dosing allows for greater control over growing conditions, including flowering/fruit growth</li>\n</ul>\n</td>\n<td style=\"width: 50%;\">\n<ul>\n<li>Aquaponics relies on establishing a bacterial colony</li>\n<li>Nutrient dosing is costly to automate and is sensitive to sensor drift which increases maintenance requirements</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"mcetoc_1eh7q4ekdf7\">Size</h4>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 50%;\">Larger</td>\n<td style=\"width: 50%;\">Smaller</td>\n</tr>\n<tr>\n<td style=\"width: 50%;\">\n<ul>\n<li>Grow more food</li>\n<li>Less sensitive to wide swings in growing conditions</li>\n<li>More customization and expandable</li>\n</ul>\n</td>\n<td style=\"width: 50%;\">\n<ul>\n<li>Takes up less space</li>\n<li>Smaller initial investment</li>\n<li>Less setup time</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"mcetoc_1eh7q4ekdf8\">Automation</h4>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 50%;\">More</td>\n<td style=\"width: 50%;\">Less</td>\n</tr>\n<tr>\n<td style=\"width: 50%;\">\n<ul>\n<li>Reduce maintenance</li>\n<li>Measure and optimize growing</li>\n</ul>\n</td>\n<td style=\"width: 50%;\">\n<ul>\n<li>Cheaper</li>\n<li>Simpler, smaller number of components that could fail</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"mcetoc_1eh7q4ekdf9\">Customizability vs Simplicity</h4>\n<p>With any product there is an inherent trade-off between customizability and simplicity. Android vs Apple, API vs web interface, blank notebook vs planner, etc. The clear initial design directive here is modularity. As seen in the sections above, there are clear engineering trade-offs for size and automation. Designing with these modularity parameters in mind can allow the product to shift in response to user demands.</p>\n<hr>\n<p>Next in this series is <a href=\"#non-existing-post-with-id-26\">Aquaponics | Plant science turned into design parameters</a> (Coming mid-September) where we delve into the biology, chemistry, physics, and other physical science phenomena that make uFarm work.</p>\n<p><a href=\"#non-existing-post-with-id-26\" class=\"btn\">Read Part 2</a></p>",
            "image": "https://blog.garrettdowd.com/media/posts/21/IMG_5656.jpg",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Projects",
                   "Product Management"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/how-to-never-kill-another-plant/",
            "url": "https://blog.garrettdowd.com/how-to-never-kill-another-plant/",
            "title": "How to Never Kill Another Plant",
            "summary": "Over-watering is the #1 cause of houseplant death. What if I told you there was a way to never worry&hellip;",
            "content_html": "<p class=\"msg msg--info\">Over-watering is the #1 cause of houseplant death.</p>\n<p>What if I told you there was a way to never worry about watering your plants again, even when absent for months at a time. What if I told you there is a way to grow plants twice as fast with no synthetic fertilizer? This article will discuss how create a self-sustaining indoor grow system that requires very little maintenance and can provide a surprisingly large amount of food.</p>\n<p>In the previous two articles <a href=\"https://blog.garrettdowd.com/why-food-sucks/\">Why Food Sucks</a> and <a href=\"https://blog.garrettdowd.com/the-future-of-food-is-hyper-local/\">The Future of Food is Hyper-local</a>, I reviewed critical issues with our current food system and potential solutions to those issues. Growing your own food is a small, but important piece of the solution to building a healthier, more sustainable food system. Using the scientific understanding of hydroponics and engineering principles from system design and automation, growing your own food can be a realistic goal even for time-constrained urban dwellers. This is the idea behind the <a href=\"https://github.com/garrettdowd/ufarm\" target=\"_blank\" rel=\"noopener noreferrer\">uFarm open-source project</a>. Learn more about <a href=\"https://blog.garrettdowd.com/designing-ufarm/\">how I designed uFarm.</a></p>\n<div class=\"gallery-wrapper gallery-wrapper--wide\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_6610.jpg\" data-size=\"1263x947\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_6610-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Initial Concept Drawing</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_5867.jpg\" data-size=\"673x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_5867-thumbnail.jpg\" alt=\"\" width=\"673\" height=\"898\"></a>\n<figcaption>Initial Prototype</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_5870.jpg\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_5870-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>DWC Netpots</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_5869.jpg\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_5869-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>LECA Flood/Drain Beds</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_6173.jpg\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_6173-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>DWC Experimental Growth</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_6171.jpg\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_6171-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Birdseye Chili Growth</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_6172.jpg\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/20/gallery/IMG_6172-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Basil Growth</figcaption>\n</figure>\n</div></div>\n<h2>uFarm</h2>\n<p>uFarm uses principles from aquaponics to design a self-sustaining micro-ecosystem that can grow plants for weeks to months without any intervention or maintenance.</p>\n<p class=\"msg msg--info\">I left the system running autonomously for more than a month while travelling and I came back to plants that had quadrupled in size.</p>\n<p>Aquaponics is a way of providing nutrients to plants that mimics a natural ecosystem cycle.</p>\n<ol>\n<li>Fish are fed (possibly with food scraps)</li>\n<li>Fish produce waste (ammonia)</li>\n<li>Nitrifying bacteria convert ammonia to nitrites and then nitrates</li>\n<li>Plants uptake nitrates, in effect cleaning the water for the fish</li>\n</ol>\n<p>A variety of hydroponic techniques can be applied to aquaponics. The initial uFarm prototype uses flood &amp; drain media beds as well as deep water culture, however nutrient film technique or aeroponics can also be designed into an aquaponic system.</p>\n<h2>How uFarm Works</h2>\n<p>uFarm is not just a simple aquaponic system, it is a highly automated, connected, and integrated system. It was designed using a variety of engineering tools from Darcy-Weisbach fluid flow equations to multi-physics modelling for over-constrained mechanical loading conditions. The entire system is highly coupled, which is engineering speak that means if you change the size/design/specification of one component then it changes multiple other system component requirements. For simplicity, much of the high-level parametric design was carried out in a <a href=\"https://github.com/garrettdowd/ufarm/blob/master/System%20Design.xlsx\" target=\"_blank\" rel=\"noopener noreferrer\">spreadsheet</a> that could be used to design systems that are larger or smaller. Don't worry, I am not going into technical detail in this article. However, if you want to dive into the design and engineering process then head to my article on <a href=\"https://blog.garrettdowd.com/designing-ufarm/\">Designing uFarm</a>.</p>\n<p class=\"msg msg--info\">Â The idea behind uFarm is to hide a lot of the difficult engineering and biology behind easy to use design tools and user interfaces.</p>\n<p>To get a better sense of what goes into a uFarm system take a look at the system diagram below. This system is fully recirculating and contains enough water to run for more than a month (accounting for evaporation and plant uptake). In fact, this system requires less maintenance than a normal fish tank because the plants are doing the heavy lifting of removing excess nitrates from the system.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/20/Annotation-2020-08-24-120620.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/20/responsive/Annotation-2020-08-24-120620-xs.png 384w ,https://blog.garrettdowd.com/media/posts/20/responsive/Annotation-2020-08-24-120620-sm.png 600w ,https://blog.garrettdowd.com/media/posts/20/responsive/Annotation-2020-08-24-120620-md.png 768w ,https://blog.garrettdowd.com/media/posts/20/responsive/Annotation-2020-08-24-120620-lg.png 1200w\"  alt=\"\"></figure>\n<ol>\n<li>Water is first pumped to the top fish tank from the bottom DWC containers. The pump is controlled by the system's computer which regulates the watering cycles.</li>\n<li>Water from the fish tank then overflows into the media beds in the middle. The media beds serve a variety of purposes. It traps physical fish waste particles and also houses the majority of the nitrifying bacteria that breaks down ammonia into nitrates.</li>\n<li>The media beds are designed as a flood and drain system. Each bed has an electronically activated direct action valve and water sensor that controls when the water from the bed is drained into the DWC container below.</li>\n</ol>\n<h2>The Growing Edge of Plant Research</h2>\n<p>NASA has been a leader in hydroponic science (it's the best way to grow food in space thanks to its recirculating design). While there is a good amount of fundamental science that understands how \"root zone\" conditions affect plant growth, there are still a huge number of growth parameter questions. Each plant has it's own specific environmental condition \"recipes\" that optimize growth and specific chemical compound concentrations that affect flavor and more.</p>\n<p>Nutrient concentrations, pH, dissolved oxygen, temperature, light spectral power distributions, humidity, CO2 concentrations are all parameters that affect plant growth. These parameters vary over time and influence plant growth. For example, many fruiting plants require shorter light cycles with more red light to enter a flowering/fruiting stage.</p>\n<p>If you enter the Google Scholar hydroponics rabbit hole (like I did) you will find journal articles that study specific growth parameters for specific species of plants. There is no unified theory that can fully optimize growth for any plant. As a science nerd, this really gets me going. I get to play with knowledge at the edge of scientific understanding... and I get to eat the results afterwards!</p>\n<p>uFarm is built with this experimentation in mind. The system is capable of programmatically changing growing parameters such as light intensity, light spectral distribution, water cycles, humidity, and temperature. In other words, it can follow tried and tested grow recipes or it help you experiment and create your own.</p>\n<h2>How to Design Your Own uFarm</h2>\n<p>uFarm is more than just a single design as seen in pictures above. It aims to be a set of open-source design tools and software infrastructure that can help anyone create an automated hydroponic/aquaponic system that fits their specific needs (size, cost, types of plants).</p>\n<p>Unfortunately that goal is still a few years in the future. In the short-term, the project aims to offer more \"base-models\" or specific size configurations that will fit most users' needs. If you are technically included (hardware or software) then head over to the <a href=\"https://github.com/garrettdowd/ufarm\" target=\"_blank\" rel=\"noopener noreferrer\">uFarm Github</a> page and give it a follow. If you are interested in checking out the build log for the prototype system then check out my article on <a href=\"https://blog.garrettdowd.com/designing-ufarm/\">Designing uFarm</a>.</p>\n<p>Overall, the system worked amazingly well for a prototype. It kept me fed with seriously good tasting herbs and required almost zero effort/time. However, there was a lot of learning from the initial prototype.</p>\n<ol>\n<li>Building a custom glass fish tank was stupid hard for an inexperienced caulker. In my opinion, the aesthetic improvement was not worth the effort.</li>\n<li>The piping design needs to be modified to reduce noise. Gurgling water is quite loud in a small apartment.</li>\n<li>The system was too large for a single person. I was making basil pesto so often that I had to give it away to friends.</li>\n<li>Media beds were too time intensive to build and tear down. Would probably design a NFT/Drip Irrigation level with a separate bio and particle filter.</li>\n<li>DWC bed was difficult to keep light tight. Light exposure causes excess algae growth which increases maintenance. This will also be an issue for aeroponics and NFT systems.</li>\n<li>The intensity and color of the light can be disruptive to a living area. Automated or adjustable shrouds would be a great addition.</li>\n</ol>\n<p>Â </p>\n<p>Â </p>",
            "image": "https://blog.garrettdowd.com/media/posts/20/aquaponics.jpg",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Projects",
                   "Food"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/the-future-of-food-is-hyper-local/",
            "url": "https://blog.garrettdowd.com/the-future-of-food-is-hyper-local/",
            "title": "The Future of Food is Hyper-local",
            "summary": "The image below is the first result on Google for the search term \"agriculture\". It is also what first comes&hellip;",
            "content_html": "<p>The image below is the first result on Google for the search term \"agriculture\". It is also what first comes to mind for most people. However, traditional soil culture methods alone do not meet the needs of a growing world population and growing urban centers. Incremental improvement and corporate mergers are not sustainable solutions for the future of our food.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/19/5.6._aaheader.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/19/responsive/5.6._aaheader-xs.png 384w ,https://blog.garrettdowd.com/media/posts/19/responsive/5.6._aaheader-sm.png 600w ,https://blog.garrettdowd.com/media/posts/19/responsive/5.6._aaheader-md.png 768w ,https://blog.garrettdowd.com/media/posts/19/responsive/5.6._aaheader-lg.png 1200w\"  alt=\"\"></figure>\n<p>If you haven't already read my article, <a href=\"https://blog.garrettdowd.com/why-food-sucks/\">Why Food Sucks</a>, this would be a great time. This is the second article in a three part series on automated urban farming. As mentioned in the previous article, a possible \"radical\" solution to our growing food problems is to rewind the clock and return to a more decentralized production model using the latest scientific understanding of topics from the biology of plants to the quantum physics of LEDs.</p>\n<p>Hyper-local food production is such a vision for the future. In fact, you may already be purchasing food from one of the many hyper-local farms including <a href=\"https://boweryfarming.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Bowery</a>, <a href=\"http://www.evgoh.com/gcg/\" target=\"_blank\" rel=\"noopener noreferrer\">Green City Growers</a>, <a href=\"https://www.brightfarms.com/\" target=\"_blank\" rel=\"noopener noreferrer\">BrightFarms</a>, <a href=\"https://www.greatlakesgrowers.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Great Lakes Growers</a>, <a href=\"https://www.plenty.ag/\" target=\"_blank\" rel=\"noopener noreferrer\">Plenty</a>, and <a href=\"https://aerofarms.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Aerofarms</a>.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/19/AeroFarms-DreamGreens.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/19/responsive/AeroFarms-DreamGreens-xs.jpg 384w ,https://blog.garrettdowd.com/media/posts/19/responsive/AeroFarms-DreamGreens-sm.jpg 600w ,https://blog.garrettdowd.com/media/posts/19/responsive/AeroFarms-DreamGreens-md.jpg 768w ,https://blog.garrettdowd.com/media/posts/19/responsive/AeroFarms-DreamGreens-lg.jpg 1200w\"  alt=\"\" width=\"320\" height=\"320\"></figure>\n<h2>Hyper-local Food Production</h2>\n<p>Hyper-local food production at commercial scales generally aims to solve two main problems posed in <a href=\"https://blog.garrettdowd.com/why-food-sucks/\">Why Food Sucks</a>;</p>\n<ol>\n<li>Transportation</li>\n<li>Chemical and pharmaceutical use</li>\n</ol>\n<p>Removing these problems from the equation enables;</p>\n<ol>\n<li>Cultivars chosen for flavor/nutrition</li>\n<li>Food harvested closer to peak flavor/nutrition</li>\n<li>Reduced emissions from transportation</li>\n<li>Reduced number of middle men (more supply chain transparency, less corruption)</li>\n<li>Reduced ecological damage from pesticides (save the bees!)</li>\n<li>Reduce possible chronic disease caused by chemical use</li>\n<li>More \"in-tune\" and responsive to community needs/wants</li>\n</ol>\n<p>This is ironic to me because, in this narrow perspective, food production was better a century ago than it is now.</p>\n<p>So what does hyper-local food production actually look like anyway?Â </p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/images.jpg\" data-size=\"287x175\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/images-thumbnail.jpg\" alt=\"\" width=\"287\" height=\"175\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/AeroFarms-Indoor-Vertical-Farming-Wide-Shot.jpg\" data-size=\"1920x1080\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/AeroFarms-Indoor-Vertical-Farming-Wide-Shot-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"432\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/Square-Roots-urban-indoor-farming-shipping-container-model-goes-nationwide_wrbm_large.jpg\" data-size=\"749x493\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/Square-Roots-urban-indoor-farming-shipping-container-model-goes-nationwide_wrbm_large-thumbnail.jpg\" alt=\"\" width=\"749\" height=\"493\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/Schmidtfarmshot-1200x798.jpg\" data-size=\"1200x798\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/Schmidtfarmshot-1200x798-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"511\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/communitygarden_james.jpg\" data-size=\"863x575\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/communitygarden_james-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"512\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/Community-garden.jpg\" data-size=\"628x472\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/Community-garden-thumbnail.jpg\" alt=\"\" width=\"628\" height=\"472\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/20190503_104602.jpg\" data-size=\"1000x563\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/20190503_104602-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"432\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/image3.jpg\" data-size=\"733x980\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/image3-thumbnail.jpg\" alt=\"\" width=\"733\" height=\"980\"></a></figure>\n</div></div>\n<p class=\"msg msg--info\">Hyper-local food production can range from personal gardens to large indoor vertical farms.</p>\n<p>The more decentralized and diverse food production is the more resistant it is to any single source of failure (disease, drought, destruction, etc). It is important to have a range of production scales.</p>\n<h3>Commercial Scale</h3>\n<p>There are a lot of people that need to eat. Modern controlled environment agriculture (CEA) science allows us to grow produce more quickly, in higher densities, with better water efficiency than ever before. Hydroponics is a fast developing field of agricultural science that is at the heart of the commercial scale operations seen above. The most popular hydroponic techniques used at a commercial scale are</p>\n<ul>\n<li>Vertical and Roof Farms\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Aeroponics\" target=\"_blank\" rel=\"noopener noreferrer\">Aeroponics</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Nutrient_film_technique\" target=\"_blank\" rel=\"noopener noreferrer\">Nutrient Film Technique</a> (NFT) a.k.a. Shallow Water Culture (SWC)</li>\n</ul>\n</li>\n<li>Greenhouses\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Deep_water_culture\" target=\"_blank\" rel=\"noopener noreferrer\">Deep Water Culture</a> (DWC)</li>\n<li>Substrate-based\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Ebb_and_flow\" target=\"_blank\" rel=\"noopener noreferrer\">Ebb and Flow</a> a.k.a. Flood and Drain</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Drip_irrigation\" target=\"_blank\" rel=\"noopener noreferrer\">Drip Irrigation</a></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>Hydroponics is generally defined in the United States as growing plants without soil (including non-soil substrates like rockwool). This means that macro and micro nutrients that normally come from the soil or fertilizers must be provided through other means. Many hydroponic operations use nutrient dosing (adding refined macro/micro nutrient concentrates) to easily create the proper conditions for optimal growth.</p>\n<p>However there are more natural ways to grow produce hydroponically. One such method is called aquaponics.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/19/8004f79b480caa8b26ab66768128eb15.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/19/responsive/8004f79b480caa8b26ab66768128eb15-xs.jpg 384w ,https://blog.garrettdowd.com/media/posts/19/responsive/8004f79b480caa8b26ab66768128eb15-sm.jpg 600w ,https://blog.garrettdowd.com/media/posts/19/responsive/8004f79b480caa8b26ab66768128eb15-md.jpg 768w ,https://blog.garrettdowd.com/media/posts/19/responsive/8004f79b480caa8b26ab66768128eb15-lg.jpg 1200w\"  alt=\"Example Aquaponics System\"></figure>\n<p class=\"msg msg--info\">Aquaponics is a hydroponic growing method where fish and plants are grown symbiotically, mimicking the nitrogen cycle in nature.</p>\n<p>Fish produce waste which are converted to nitrates by bacteria. The plants then clean the water for the fish by uptaking nitrates and other macro/micro nutrients. You can <a href=\"https://blog.garrettdowd.com/how-to-never-kill-another-plant/\">read more about aquaponics in the next article</a>.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/19/aquaponics-cycle_52d50c234a23c_w1500.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/19/responsive/aquaponics-cycle_52d50c234a23c_w1500-xs.png 384w ,https://blog.garrettdowd.com/media/posts/19/responsive/aquaponics-cycle_52d50c234a23c_w1500-sm.png 600w ,https://blog.garrettdowd.com/media/posts/19/responsive/aquaponics-cycle_52d50c234a23c_w1500-md.png 768w ,https://blog.garrettdowd.com/media/posts/19/responsive/aquaponics-cycle_52d50c234a23c_w1500-lg.png 1200w\"  alt=\"\" width=\"387\" height=\"289\"></figure>\n<h3>Community Scale</h3>\n<p>Humans have been foraging and cultivating food forever. Finding food, growing food, and harvesting food all have deeply ingrained reward mechanisms that evolved over tens of thousands of years. Communities that grew food together survived together. It would be biologically ignorant to disregard the social benefits of community gardens.Â </p>\n<p>Community gardens also help educate people about food. What does good/fresh food actually taste like? What varieties exist? How do you cook it? These are important questions that can encourage commercial scale operations to produce a wider variety of produce, which ultimately provides a more comprehensive source of nutrition. While community gardens can be difficult for a working community to manage and upkeep, there are design methodologies that could help, such as permaculture. <a href=\"https://en.wikipedia.org/wiki/Permaculture\" target=\"_blank\" rel=\"noopener noreferrer\">Permaculture</a> is a fascinating area of biomimetic agricultural design to dive into if sustainability and ecology interest you.</p>\n<p>Ultimately, community gardens need to start from within the community and personal gardens are a great way to start.</p>\n<h3>Personal Scale</h3>\n<p>Growing food at home has many of the same benefits as community gardens. Growing food at home is not about reducing food costs. It is about flavor, variety, a sense of accomplishment, and a connection with nature. However, growing food at home can be difficult for busy families and urban dwellers, especially at a scale that provides more than a handful of tomatoes or a single annual bushel of basil.</p>\n<p>Luckily, there are a few options to reduce the burden of managing a home garden (micro-farm). For traditional outdoor or greenhouse soil-culture there is the open-source <a href=\"https://farm.bot/\" target=\"_blank\" rel=\"noopener noreferrer\">Farmbot</a> (I am a huge fan), which automatically seeds, waters, and weeds an outdoor grow bed. There are also hydroponic systems that are designed for indoor use such as <a href=\"https://www.seedolab.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Seedo</a> and <a href=\"https://www.grobo.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Grobo</a>. Unsurprisingly, these startups are focused on the cannabis market and should also work well for other fruiting plants like tomato and pepper. However, they are not great designs for serious leafy green and herb production.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/DSC00229.JPG\" data-size=\"5935x3956\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/DSC00229-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"512\"></a>\n<figcaption>FarmBot System</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/19/gallery/IMG_9400.JPG\" data-size=\"4898x3265\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/19/gallery/IMG_9400-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"512\"></a>\n<figcaption>FarmBot System</figcaption>\n</figure>\n</div></div>\n<p class=\"msg msg--info\">As a cooking/food enthusiast and also a busy urban dweller, I sought a solution that would allow me to grow enough produce for daily meals..... inside my 700 sqft third-floor apartment.</p>\n<p>This is what led me to design and build <a href=\"https://github.com/garrettdowd/ufarm\" target=\"_blank\" rel=\"noopener noreferrer\">uFarm</a>, an automated nano-farm for urban dwellers.Â  If you are immediately interested in the technical details and build process then feel free to skip to my article on <a href=\"https://blog.garrettdowd.com/designing-ufarm/\">Designing uFarm</a>. Otherwise, the third article in this series will discuss the Why and What of uFarm. Continue reading to see how easy it is to grow your own food!</p>\n<p><a href=\"https://blog.garrettdowd.com/how-to-never-kill-another-plant/\" class=\"btn\">Part 3</a></p>\n<p>Â </p>\n<p>Â </p>",
            "image": "https://blog.garrettdowd.com/media/posts/19/vertical-farming.webp",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Food"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/ultimate-fulbright-guide/",
            "url": "https://blog.garrettdowd.com/ultimate-fulbright-guide/",
            "title": "The Ultimate Fulbright Guide",
            "summary": "There is a lot to know and an overwhelming amount of information on the web about Fulbright. This post will&hellip;",
            "content_html": "<p>There is a lot to know and an overwhelming amount of information on the web about Fulbright. This post will serve as a hub with what I think (my personal opinions) are the best sources of information for prospective applicants looking to complete a Fulbright abroad.</p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1efs81jsp1a\">Where to Start?</a></li>\n<li><a href=\"#mcetoc_1efs81jsp1b\">What is Fulbright?</a></li>\n<li><a href=\"#mcetoc_1efs81jsp1c\">Benefits of Being a Fulbright Scholar</a>\n<ul>\n<li><a href=\"#mcetoc_1efs81jsp1d\">How I Benefited from Fulbright (United Kingdom)</a>\n<ul>\n<li><a href=\"#mcetoc_1efs81jsp1e\">Tangibles</a></li>\n<li><a href=\"#mcetoc_1efs81jsp1f\">Intangibles</a></li>\n<li><a href=\"#mcetoc_1efs1t61r3g\">London</a></li>\n<li><a href=\"#mcetoc_1efs81jsp1g\">Additional Opportunities</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1efs81jsp1h\">Is Fulbright worth it?</a></li>\n<li><a href=\"#mcetoc_1efs81jsp1i\">How do I select an Award to apply for?</a></li>\n<li><a href=\"#mcetoc_1efs81jsp1j\">How do I apply?</a></li>\n<li><a href=\"#mcetoc_1efs81jsp1k\">Chances of getting a Fulbright scholarship?</a></li>\n<li><a href=\"#mcetoc_1efs81jsp1l\">What makes a competitive application?</a>\n<ul>\n<li><a href=\"#mcetoc_1efs7dhl89d\">Audience</a></li>\n<li><a href=\"#mcetoc_1efs7dhl89e\">Advice from the UK Commission</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1efs81jsp1m\">How do I improve my application?</a></li>\n<li><a href=\"#mcetoc_1efs8q1tja3\">Other Questions</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1efs81jsp1a\">Where to Start?</h2>\n<ol>\n<li>The best place to start is the <a href=\"https://us.fulbrightonline.org/about\" target=\"_blank\" rel=\"noopener noreferrer\">official Fulbright website</a>. I highly recommend reading through all of the \"About\" sections. Most questions can be answered there. The <a href=\"https://us.fulbrightonline.org/about/eligibility\" target=\"_blank\" rel=\"noopener noreferrer\">Eligibility</a> page is also an important read (spoiler: you can't yet have a doctorate degree but you must have a bachelor degree by the start of the grant period)</li>\n<li>If you are currently a student or are recently graduated the next best place to start is with your university's Fulbright Program Advisor (FPA). The FPA is often a faculty member dedicated to helping students with the application process. Do not discount their experience and knowledge about the general process! You can use the Fulbright website to <a href=\"https://us.fulbrightonline.org/applicants/search-for-a-fulbright-program-adviser\" target=\"_blank\" rel=\"noopener noreferrer\">search for your university's FPA</a>. They will probably appreciate it if you read the info on the official website first ðŸ˜</li>\n<li>Read the rest of this post.</li>\n<li>Check out <a href=\"https://us.fulbrightonline.org/alumni/alumni-ambassadors\">current and past Fulbright Alumni Ambassadors</a> and reach out! Alternatively, find the person who had the Award you are interested (Linkedin and Google are good starting points, or use the <a href=\"https://us.fulbrightonline.org/component/filter/?view=filter\" target=\"_blank\" rel=\"noopener noreferrer\">Fulbright Grantee Directory</a>)</li>\n<li>Check out <a href=\"https://us.fulbrightonline.org/resources/recorded-webinars\" target=\"_blank\" rel=\"noopener noreferrer\">Recorded Webinars</a> with detailed application information.</li>\n</ol>\n<h2 id=\"mcetoc_1efs81jsp1b\">What is Fulbright?</h2>\n<p>Since you already know the basics I am going to <strong>delve into some of the complexities</strong> of the program to provide better context.Â </p>\n<ul>\n<li>The Fulbright umbrella actually <span style=\"text-decoration: underline;\">contains multiple</span> academic-based programs\n<ul>\n<li>the Fulbright U.S. Student Program, for students and professionals</li>\n<li>the Fulbright Scholar Program, for university faculty</li>\n<li>other specific awards, <a href=\"https://eca.state.gov/fulbright/fulbright-programs\" target=\"_blank\" rel=\"noopener noreferrer\">see the full list on the State Department website</a></li>\n</ul>\n</li>\n<li>The Fulbright Programs are partially <span style=\"text-decoration: underline;\">funded by</span> annual appropriations from Congress and are housed under the Department of State, specifically the <a href=\"https://eca.state.gov/\" target=\"_blank\" rel=\"noopener noreferrer\">Bureau of Educational and Cultural Affairs (ECA)</a>. However, ECA contracts the administration of the program to <a href=\"https://www.iie.org/\" target=\"_blank\" rel=\"noopener noreferrer\">The Institute of International Education</a>. Other funding (less than 50% as of 2019) comes from partner countries and institutions. However some Fulbright Awards are fully financed by partner countries or institutions.\n<ul>\n<li>This means that the program is funded at the discretion of Congress and under the policy direction of the Executive Branch. The President appoints the <a href=\"https://eca.state.gov/fulbright/about-fulbright/j-william-fulbright-foreign-scholarship-board-ffsb\">J. William Fulbright Foreign Scholarship Board (FFSB)</a>.\n<ul>\n<li>Fulbright has long received bipartisan support from Congress because the program has a concrete impact in both <a href=\"https://en.wikipedia.org/wiki/Fulbright_Program#Notable_alumni\" target=\"_blank\" rel=\"noopener noreferrer\">developing leaders</a> and increasing \"<a href=\"https://en.wikipedia.org/wiki/Soft_power\" target=\"_blank\" rel=\"noopener noreferrer\">soft power</a>\" worldwide. It is seen as one of the most powerful peace keeping tools and is strongly supported by military generals.</li>\n</ul>\n</li>\n<li>Awards come and go as foreign affairs policy and relationships change (both in the U.S. and in partner countries). The availability of an Award may also be dependent on a specific institution.</li>\n</ul>\n</li>\n<li>Fulbright is a partnership program between the U.S. and 160+ countries. While IIE administers the project in the U.S., they rely on working with partner countries for both funding, implementation, and applications of the Fulbright programs.\n<ul>\n<li>Many of the largest partner countries (49) have commissions which oversee the program. <a href=\"https://eca.state.gov/fulbright/about-fulbright/funding-and-administration/fulbright-commissions\" target=\"_blank\" rel=\"noopener noreferrer\">A full list is here.</a> While U.S. embassies oversee the program directly in many other countries.</li>\n<li><span style=\"text-decoration: underline;\">This means that a foreign commission or a U.S. embassy will most likely make the final decision on your application.</span></li>\n</ul>\n</li>\n</ul>\n<p class=\"msg msg--highlight \">ECA also houses <a href=\"https://exchanges.state.gov/us/alphabetical-list-programs\" target=\"_blank\" rel=\"noopener noreferrer\">other international exchange programs</a> so be sure to check them out!!!</p>\n<h2 id=\"mcetoc_1efs81jsp1c\">Benefits of Being a Fulbright Scholar</h2>\n<p>The website gives the tangible benefits of the Award which includes at minimum</p>\n<ul>\n<li>round-trip transportation to the host country\n<ul>\n<li>A lump sum for you to book your own transportation</li>\n</ul>\n</li>\n<li>funding to cover room, board, and incidental costs\n<ul>\n<li>How generous this is depends on a variety of factors including cost of living. The expectation is to be funded at the level of an American graduate student (GRA/GTA), however some Awards provide more (or possibly less).</li>\n</ul>\n</li>\n<li>Federal government non-competitive eligibility (NCE) status for 12 months\n<ul>\n<li>great if you want to work at a federal agency (NASA/DOE/CIA/etc) after Fulbright</li>\n</ul>\n</li>\n</ul>\n<p>However, if these were the only benefits then there would be very little difference from GTA/GRA funding. Fulbright is such a prized award because of the country specific and intangible benefits that cannot be guaranteed nor freely received. I will provide examples from my own experience and also link to other Fulbrighter's posts as I find them.</p>\n<h3 id=\"mcetoc_1efs81jsp1d\">How I Benefited from Fulbright (United Kingdom)</h3>\n<h4 id=\"mcetoc_1efs81jsp1e\">Tangibles</h4>\n<ul>\n<li>Full Tuition Waiver</li>\n<li>Orientation in London | <a href=\"https://blog.garrettdowd.com/USOR Itinerary 2016.pdf\">full itinerary</a><a href=\"https://blog.garrettdowd.com/media/files/USOR Itinerary 2016.pdf\"></a><a href=\"https://blog.garrettdowd.com/USOR Itinerary 2016.pdf\"></a>\n<ul>\n<li>Q&amp;A with U.S. Ambassador Barzun</li>\n<li>Conversations with former Chief of Staff to Tony Blair</li>\n<li>Houses of Parliament with Lord Victor Adebowale</li>\n</ul>\n</li>\n<li>Fulbright Forum in Newcastle | <a href=\"https://blog.garrettdowd.com/media/files/Fulbright Forum 2017 at Northumbria University.pdf\">full itinerary</a>\n<ul>\n<li>Visit Lord Mayorâ€™s Council Chambers,Â <span class=\"il\">Newcastle</span>Â Civic CentreÂ </li>\n<li>Private viewing of Baltic Centre for Contemporary Art</li>\n<li>Tour of Alnwick Gardens</li>\n</ul>\n</li>\n<li>End-cap in Edinburgh | <a href=\"https://blog.garrettdowd.com/media/files/EndCap.pdf\">full itinerary</a></li>\n<li>Events at U.S. Embassy in London</li>\n<li>RSA (Royal Society of Arts) Membership\n<ul>\n<li>Access to RSA House and exclusive events/lectures</li>\n</ul>\n</li>\n<li>Royal Oak Membership</li>\n<li>Fulbrighter Access\n<ul>\n<li>Exclusive network for Fulbright Alumni</li>\n</ul>\n</li>\n</ul>\n<div class=\"gallery-wrapper gallery-wrapper--wide\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_6719-1.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_6719-1-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Q&amp;A with Ambassador Barzun</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_6739-1.JPG\" data-size=\"674x899\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_6739-1-thumbnail.JPG\" alt=\"\" width=\"674\" height=\"899\"></a>\n<figcaption>House of Parliament</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7999.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7999-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Alnwick Garden (in winter)</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_0141.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_0141-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Screening at RSA House</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_2202.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_2202-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Scottish Highlands after Endcap</figcaption>\n</figure>\n</div></div>\n<h4 id=\"mcetoc_1efs81jsp1f\">Intangibles</h4>\n<p>The most important yet the most difficult to explain with words and pictures. This is the real long term value of Fulbright.</p>\n<ul>\n<li>friendships</li>\n<li>network</li>\n<li>self-development</li>\n</ul>\n<h4 id=\"mcetoc_1efs1t61r3g\">London</h4>\n<p>London doesn't need an introduction. However, the new UCL School of Management campus in Canary Wharf, One Canada Square, has breathtaking views.</p>\n<div class=\"gallery-wrapper gallery-wrapper--wide\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7011.JPG\" data-size=\"2275x2275\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7011-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"768\"></a>\n<figcaption>UCL Main Campus</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7005.JPG\" data-size=\"2167x2167\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7005-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"768\"></a>\n<figcaption>Views From the UCL Campus in One Canada Square</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7105.JPG\" data-size=\"2448x2448\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7105-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"768\"></a>\n<figcaption>Views From the UCL Campus in One Canada Square</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_6870.JPG\" data-size=\"2448x2448\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_6870-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"768\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7077.JPG\" data-size=\"2448x3059\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7077-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"960\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_6988.JPG\" data-size=\"2157x2157\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_6988-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"768\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_2944.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_2944-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_3348.jpg\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_3348-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Living in East London</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_0243-2.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_0243-2-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>At London City Hall</figcaption>\n</figure>\n</div></div>\n<h4 id=\"mcetoc_1efs81jsp1g\">Additional Opportunities</h4>\n<p>Fulbright places you in a new environment and gives you credentials to make things happen. These are some of the highlights from my time in the UK to show what is possible.</p>\n<ul>\n<li><a href=\"https://hackpartners.com/hackathons/\" target=\"_blank\" rel=\"noopener noreferrer\">Hacktrain</a> 3.0 and Hong Kong\n<ul>\n<li>Participated in and won the largest transportation hackathon in Europe. Won trip to Hong Kong to participate in Hacktrain HK.</li>\n</ul>\n</li>\n<li>UCL Bright Ideas\n<ul>\n<li>entrepreneurial competition for equity-free grant sponsored by UCL</li>\n</ul>\n</li>\n<li>UCL Startup Trek - Tel Aviv\n<ul>\n<li>Led the School of Management trip to meet with the startup community in Israel</li>\n</ul>\n</li>\n<li><a href=\"https://foundersofthefuture.co/\" target=\"_blank\" rel=\"noopener noreferrer\">Founders of the Future</a>, <a href=\"https://ffactor.me/\" target=\"_blank\" rel=\"noopener noreferrer\">FFactor</a>, <a href=\"https://ff.co/\" target=\"_blank\" rel=\"noopener noreferrer\">Founder's Forum</a>\n<ul>\n<li>Joined young entrepreneur organization and participated in UK's premier pitch competitionÂ </li>\n</ul>\n</li>\n<li><a href=\"https://blockchainlive.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Blockchain Live</a>\n<ul>\n<li>Met with industry leaders when Bitcoin was at $30,000+ USD</li>\n</ul>\n</li>\n<li><a href=\"https://www.hyperlooptt.com/\" target=\"_blank\" rel=\"noopener noreferrer\">HyperloopTT</a>\n<ul>\n<li>Connected with founder of HyperloopTT and worked with them internationally</li>\n</ul>\n</li>\n<li>National and International Travel\n<ul>\n<li>Brighton, Bath, Cornwall, Kent, Newcastle, Manchester, Liverpool, Edinburgh, Scottish Highlands, France, Netherlands, Croatia</li>\n</ul>\n</li>\n</ul>\n<div class=\"gallery-wrapper gallery-wrapper--wide\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7156-1.JPG\" data-size=\"1334x749\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7156-1-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"431\"></a>\n<figcaption>Winning Hacktrain 3.0</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7545.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7545-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Ngong Ping 360 during Hong Kong Hackathon</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7808.JPG\" data-size=\"720x479\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7808-thumbnail.JPG\" alt=\"\" width=\"720\" height=\"479\"></a>\n<figcaption>Pitching at MTR HQ</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7568.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7568-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>MTR (Hong Kong Metro) HQ Control Center</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7631.JPG\" data-size=\"674x899\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_7631-thumbnail.JPG\" alt=\"\" width=\"674\" height=\"899\"></a>\n<figcaption>Playing with Boston Dynamic's Spot</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_1843.JPG\" data-size=\"1198x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_1843-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Founders of the Future Event</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_1840.JPG\" data-size=\"523x349\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_1840-thumbnail.JPG\" alt=\"\" width=\"523\" height=\"349\"></a>\n<figcaption>UCL Bright Ideas</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_0047.JPG\" data-size=\"674x899\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_0047-thumbnail.JPG\" alt=\"\" width=\"674\" height=\"899\"></a>\n<figcaption>Google London HQ</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_2961.JPG\" data-size=\"718x898\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/12/gallery/IMG_2961-thumbnail.JPG\" alt=\"\" width=\"718\" height=\"898\"></a>\n<figcaption>Blockchain Live with Brock Pierce</figcaption>\n</figure>\n</div></div>\n<h2 id=\"mcetoc_1efs81jsp1h\">Is Fulbright worth it?</h2>\n<p>Yes. It obviously depends on what you make of it, but Fulbright is unrivaled for the breadth of opportunities available. For specific countries and universities there are comparable privately funded opportunities e.g. Rhodes and Schwarzman.</p>\n<h2 id=\"mcetoc_1efs81jsp1i\">How do I select an Award to apply for?</h2>\n<p>The bad news. You can only apply for one Award. The good news. You only have to apply for one Award. There three main strategies you can use to select the right Award, but first some context.</p>\n<p>In an ideal world you might have entered your undergraduate career with your eyes set on Fulbright and you have your career planned out at least 10 years. In this case it would be easy to chose an Award that best fits your needs. I don't know of many people who live in that ideal world.</p>\n<p>I did not learn of Fulbright until my third year of undergrad. I also did not have a clear ten or five year plan. I was the first engineer in my family and I had just started to get involved in startups and research commercialization. However, I was focused on getting more international experience and Fulbright seemed like the ideal opportunity. Finding the right Fulbright Award was the first challenge. If you are in the position of getting ready to apply in the next application cycle then there are a few ways to narrow down your search.</p>\n<ul>\n<li><strong>Language</strong>\n<ul>\n<li>A number of countries have language requirements. Do you speak a language other than English? Could you become proficient in a language before applying? Generally less people apply to the Awards that have language requirements.</li>\n</ul>\n</li>\n<li><strong>Restricted Awards</strong>\n<ul>\n<li>There are a number of Awards that are for a specific area of study or research. Because Awards change on a yearly basis, this takes a lot of due diligence to search through opportunities. Again, less people generally apply for restricted Awards.</li>\n</ul>\n</li>\n<li><strong>Statistics</strong>\n<ul>\n<li>If you are interested in a general Award or an English Teaching Assistant then it may be useful to look at application statistics. <a href=\"https://us.fulbrightonline.org/statistics\" target=\"_blank\" rel=\"noopener noreferrer\">Fulbright publishes limited application statistics</a> that may help determine which Awards are highly competitive. Be cautious as application statistics vary every year and a low number of applications may encourage more people to apply the following year.</li>\n</ul>\n</li>\n<li><strong>Your Dream</strong>\n<ul>\n<li>Always wanted to study in London? IT'S A TRAP! I repeat, IT'S A TRAP! This is not a good way to choose an Award because it is not fundamentally based in what makes a strong application. The U.S. Government and its taxpayers are not funding you to go have a year long vacation in your dream destination. They expect qualified candidates that are pursuing professional goals.</li>\n</ul>\n</li>\n</ul>\n<p>That being said, there are three main categories of Awards that you can apply for.</p>\n<ul>\n<li><strong>Study</strong>\n<ul>\n<li>Obtain a [post-]graduate degree. Often tied to a thesis/dissertation.</li>\n</ul>\n</li>\n<li><strong>Research</strong>\n<ul>\n<li>Start or complete a research objective.</li>\n</ul>\n</li>\n<li><strong>English Teaching Assistant</strong>\n<ul>\n<li>Teach English. Lots of opportunities all around the world.</li>\n</ul>\n</li>\n</ul>\n<p>Generally, the English Teaching Assistant Awards are the least competitive, but also have the largest selection of countries to choose from.</p>\n<h2 id=\"mcetoc_1efs81jsp1j\">How do I apply?</h2>\n<p>The mechanics of the application process are all <a href=\"https://us.fulbrightonline.org/applicants\" target=\"_blank\" rel=\"noopener noreferrer\">provided on the Fulbright website</a>.Â  Definitely check out the <a href=\"https://us.fulbrightonline.org/applicants/application-checklists\" target=\"_blank\" rel=\"noopener noreferrer\">application checklists</a> and the <a href=\"https://us.fulbrightonline.org/applicants/application-timeline\" target=\"_blank\" rel=\"noopener noreferrer\">application timeline</a>. The only additional advice I can give here is to start EARLY (6+ months), which is much easier said than done.</p>\n<ul>\n<li>Determine where your application may be weak and gain more experience before the application deadline.</li>\n<li>Get an initial draft ASAP and revise over multiple months. Give time for your thoughts to coagulate and mature.</li>\n</ul>\n<h2 id=\"mcetoc_1efs81jsp1k\">Chances of getting a Fulbright scholarship?</h2>\n<p>There is no good answer to this. From my experience, the Fulbright application review process is more comprehensive and well-rounded than any university application process. However, it is still a selection process and competition varies from year to year.</p>\n<ul>\n<li>Fight the impostor syndrome. Looking at current Fulbright profiles can be daunting, but I can assure you that most successful Fulbright applicants feel the same way.</li>\n<li>Making a decision solely on <a href=\"https://us.fulbrightonline.org/statistics\" target=\"_blank\" rel=\"noopener noreferrer\">application statistics</a> will probably lead to a weak application. Make sure to focus on your passions or goals and let that guide your application decisions.</li>\n</ul>\n<h2 id=\"mcetoc_1efs81jsp1l\">What makes a competitive application?</h2>\n<p>There is a lot that goes into making a Fulbright Application. Your best course of action is to</p>\n<ol>\n<li>read the <a href=\"https://us.fulbrightonline.org/applicants/application-components\" target=\"_blank\" rel=\"noopener noreferrer\">official Fulbright guidance</a></li>\n<li>reach out to a Fulbright alumni for more nuanced guidance</li>\n</ol>\n<p>Otherwise here are some thoughts off the top of my head (avoid idioms in your application).</p>\n<ul>\n<li>Write for your audience\n<ul>\n<li>see below</li>\n</ul>\n</li>\n<li>Follow good story telling techniques, e.g.\n<ul>\n<li>Hook</li>\n<li>Information chunking</li>\n<li>Story structure</li>\n<li>Authenticity/Honesty</li>\n</ul>\n</li>\n<li>Big goals</li>\n<li>Relevant experience</li>\n<li>Passion for the mission of The Fulbright Program</li>\n</ul>\n<h3 id=\"mcetoc_1efs7dhl89d\">Audience</h3>\n<p>Be sure to understand the stages of application review and the audience for which you are writing the application. Generally this includes;</p>\n<ul>\n<li>Campus Committee\n<ul>\n<li>Unless you put little effort into your application and it would reflect poorly on the university, your committee should recommend your for the Award.</li>\n</ul>\n</li>\n<li>IIE/U.S. Selection\n<ul>\n<li>Applications are reviewed by relevant university faculty and professionals. You need to make sure you can convince this reader that your application is important/relevant and you are competent in your field of expertise.</li>\n</ul>\n</li>\n<li>Foreign Country\n<ul>\n<li>Foreign CommissionÂ \n<ul>\n<li>Applications are generally reviewed by accomplished individuals who volunteer their time to review applications. Fulbright alumni may also read your applications. Your application should tell a story that does not overwhelm these readers with too much technical jargon. Be wary of assumptions that may come across as culturally ignorant.</li>\n</ul>\n</li>\n<li>Embassy\n<ul>\n<li><em>This section is incomplete and will be updated atÂ  future date.</em></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"mcetoc_1efs7dhl89e\">Advice from the UK Commission</h3>\n<p><a href=\"http://www.fulbright.org.uk/going-to-the-uk/postgraduate-student-awards/how-to-apply\" target=\"_blank\" rel=\"noopener noreferrer\">Link -</a> We assess more than your academic record. The best applications are from well-rounded students who can demonstrate:</p>\n<ul>\n<li>Ambassadorial skills</li>\n<li>Intercultural sensitivityÂ </li>\n<li>Genuine desire to learn more about the UKÂ and to share aspects of American culture</li>\n<li>ExtracurricularÂ activities</li>\n<li>Community involvement</li>\n<li>Leadership potential</li>\n<li>Plans to further the Fulbright mission and giveÂ back to the US upon returning</li>\n</ul>\n<h2 id=\"mcetoc_1efs81jsp1m\">How do I improve my application?</h2>\n<ul>\n<li>Get feedback from relevant faculty/professionals</li>\n<li>Talk to a recent Fulbright alumnus (many are willing to help!)</li>\n<li>Gain cultural insights from citizens of the foreign country</li>\n<li>Gain more relevant academic/professional experience</li>\n<li>Apply for relevant awards/competitions</li>\n<li>Get some experience living abroad</li>\n</ul>\n<h2 id=\"mcetoc_1efs8q1tja3\">Other Questions</h2>\n<ul>\n<li>Check out the <a href=\"https://blog.garrettdowd.com/fulbright-faq/\">Fulbright FAQ post</a> with questions posed by real applicants.</li>\n<li>Is this guide missing something? Please let me know! My contact info can be found on the <a href=\"https://us.fulbrightonline.org/alumni/alumni-ambassadors/2019-alumni-ambassadors\" target=\"_blank\" rel=\"noopener noreferrer\">Alumni Ambassador webpage</a>.</li>\n</ul>\n<p>Â </p>",
            "image": "https://blog.garrettdowd.com/media/posts/12/fulbright.jpg",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Fulbright"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/fulbright-faq/",
            "url": "https://blog.garrettdowd.com/fulbright-faq/",
            "title": "FAQ | United Kingdom Fulbright",
            "summary": "As a Fulbright Alumni Ambassador, I often receive emails from prospective U.S. applicants with great questions about the Fulbright application&hellip;",
            "content_html": "<p>As a Fulbright Alumni Ambassador, I often receive emails from prospective U.S. applicants with great questions about the Fulbright application and experience. This post includes real questions from real applicants. Keep in mind that many responses are geared towards a Study/Postgraduate Award in the U.K.. As mentioned in my <a href=\"https://blog.garrettdowd.com/ultimate-fulbright-guide/\">Fulbright Guide</a>, details about the Fulbright program vary from year to year and the opinions expressed here are my own. The ultimate source of accurate information is theÂ <a href=\"https://us.fulbrightonline.org/\" class=\"bw dl jt ju jv jw\" target=\"_blank\" rel=\"noopener nofollow\">official Fulbright website</a>Â orÂ <a href=\"https://us.fulbrightonline.org/contact-us\" class=\"bw dl jt ju jv jw\" target=\"_blank\" rel=\"noopener nofollow\">by contacting IIE directly.</a></p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1ef3d7n98368\">Frequently Asked Questions</a>\n<ul>\n<li><a href=\"#mcetoc_1ef3d7n98369\">Should I contact the program's director or admissions? Were they receptive/helpful?</a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836a\">Do you know who I would contact about country specific questions?</a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836b\">What were the most challenging or unexpected aspects of your Fulbright experience?</a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836c\">How did you craft a compelling Statement of Grant Purpose for a degree program without falling into traps such as repeating what was listed on the universityâ€™s website?</a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836d\">Did you explore any distinctions in your field between the U.S. and the U.K.? Why didÂ  you feel the U.K. was the right place for you to study?</a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836e\">How did you incorporate your international experience in your application?</a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836f\">Do I need a letter of affiliation? How do I get one?</a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836g\">One of my largest concerns is feeling like I am not good enough for the program and it is making writing my application difficult. What was your process for writing your application and what did you highlight that made you a stand out.Â </a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836h\">Have you encountered any positives or negatives aboutÂ pursuing and receivingÂ a Master's degree abroad, as opposed to staying within the U.S.?Â </a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836i\">Did you talk about specificÂ courses or professors that interested you within the program?Â </a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836j\">Did you specify in your Statement of Grant Purpose yourÂ intended dissertation on public transportation, or was that something you developed while studying at UCL?</a></li>\n<li><a href=\"#mcetoc_1ef3d7n9836k\">In what ways did London add or detract from your experience at UCL?Â </a></li>\n<li><a href=\"#mcetoc_1efkjrb1u1q\">For Host Country Engagement, did you focus on ways to get involved within the UCL campus or with London in general? In what ways did you end up engaging with the community?Â </a></li>\n<li><a href=\"#mcetoc_1efkjrb1u1r\">Any other tips or tricks?</a></li>\n<li><a href=\"#mcetoc_1ef3dcr3036m\">General Thoughts</a></li>\n</ul>\n</li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1ef3d7n98368\">Frequently Asked Questions</h2>\n<p>Â </p>\n<h3 id=\"mcetoc_1ef3d7n98369\">Should I contact the program's director or admissions? Were they receptive/helpful?</h3>\n<p>I contacted the program director during the summer of my application. Letters of affiliation for degree programs were still suggested when I applied. They were very receptive and helpful and that can be expected from most faculty and programs that you would contact about the Fulbright. I had limited contact with the faculty compared to those who applied for research awards.</p>\n<h3 id=\"mcetoc_1ef3d7n9836a\">Do you know who I would contact about country specific questions?</h3>\n<p>First make sure to review the country specific information on the website, for example <a href=\"https://us.fulbrightonline.org/countries/selectedcountry/united-kingdom\" target=\"_blank\" rel=\"noopener noreferrer\">here is the country page for the UK</a>. Next, check if the country has a Fulbright commission. Most commissions will have a website or some web presence. Again, for example <a href=\"http://www.fulbright.org.uk/\" target=\"_blank\" rel=\"noopener noreferrer\">here is the UK Commission website</a>. Depending on your question you can also</p>\n<ol>\n<li><a href=\"https://us.fulbrightonline.org/contact-us\" target=\"_blank\" rel=\"noopener noreferrer\">Contact IIE</a></li>\n<li>Contact the commisson/embassy, <a href=\"http://www.fulbright.org.uk/about-us/contact-us\" target=\"_blank\" rel=\"noopener noreferrer\">UK Commission contact info</a></li>\n<li><a href=\"https://us.fulbrightonline.org/alumni/alumni-ambassadors\" target=\"_blank\" rel=\"noopener noreferrer\">Find a Fulbright Alumni Ambassador</a> or other alum from the relevant country</li>\n</ol>\n<h3 id=\"mcetoc_1ef3d7n9836b\">What were the most challenging or unexpected aspects of your Fulbright experience?</h3>\n<p>Everyone's unexpected challenges are quite different. Everything from severe sickness to housing problems. Living in London, most of my unexpected challenges had to do with housing.</p>\n<h3 id=\"mcetoc_1ef3d7n9836c\">How did you craft a compelling Statement of Grant Purpose for a degree program without falling into traps such as repeating what was listed on the universityâ€™s website?</h3>\n<p><a href=\"https://us.fulbrightonline.org/application-components/academic\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://us.fulbrightonline.org/application-components/academic&amp;source=gmail&amp;ust=1596749896681000&amp;usg=AFQjCNHrwpVmD7Rky--Oje_IR4c6SX_6ug\" rel=\"noopener\">The website</a>Â gives great info and lists the question at hand, \"What are your reasons for selecting a particular institution?\". To answer this question you should first speak to your current career trajectory/interests and then directly relate them to facts about the program you are applying to. For example, \"I am studying the acute response of chimpanzees when they are shown pictures of cute golden retriever puppies. The program at France University has the most cute golden retriever puppies in the world and would further my research and professional development.\"</p>\n<h3 id=\"mcetoc_1ef3d7n9836d\">Did you explore any distinctions in your field between the U.S. and the U.K.? Why didÂ  you feel the U.K. was the right place for you to study?</h3>\n<p>For my application, cultural differences were not front in center when drawing contrast between the program I was applying for and everything else out there. I made my case around the specific structure/benefits of the degree program I was applying for, which was structured quite differently than other MBA degrees, and offered clear alignment with my goals.</p>\n<h3 id=\"mcetoc_1ef3d7n9836e\">How did you incorporate your international experience in your application?</h3>\n<p>Integrating your previous international experience is very important. If you feel that your international experience ties in nicely with your \"pitch\" in the SOGP then put it there. Put less ambiguously, if your international experience is related to your academic/reserach topic or you gained knowledge that will be useful in your studies/research then include it in the SOGP. This will strengthen the (This is what I am interested in - This is what I have accomplished so far - This is why Fulbright is the best opportunity to further my career goals) pitch.</p>\n<p>If your international experience is not directly related to the topic/theme of your SOGP then put it in the personal statement. The reality is that living abroad is no small feat. Many times the degree program is the least of your worries. The selection committee wants to ensure that all grantees will last the duration of the grant and it can be useful to discuss how you handled any difficulties while living abroad.Â </p>\n<h3 id=\"mcetoc_1ef3d7n9836f\">Do I need a letter of affiliation? How do I get one?</h3>\n<p>Definitely visit the official website and look at the specific grant information. This may vary by country and Award. However, the information below might be accurate for most study grants in the UK.</p>\n<ol start=\"1\" type=\"1\">\n<li>A letter of affiliation can be either a letter of admission or a letter of acceptance. Both can be accepted for review with the application, as an applicant can submit up to three letters of affiliation. If an applicant does not have a letter of admission, but wishes to add a letter from a department or professor specifically supporting their project they can add that.</li>\n<li>You are correct, admission to a university is required for final receipt of the Fulbright award. A letter of admission is not required at the time of application, but can be accepted, and must be presented in order to receive the award.</li>\n<li>A letter of affiliation is not needed, however, both a letter of affiliation or admittance does strengthen an applicantâ€™s application.</li>\n<li>All letters of affiliation or admittance are reviewed by the National Screening Committees if they are received prior to October 8<sup>th</sup>. Further, if a candidate is moved on to semi-finalist status, any letters submitted with their application as well as any received in the interim can be reviewed by the UK Commission. Any letters can strengthen an applicantâ€™s application, but there is no disadvantage for not having one either.</li>\n</ol>\n<p>How do you get one? Many times this involves reaching out directly to faculty or program directors via emails found on the university website.</p>\n<h3 id=\"mcetoc_1ef3d7n9836g\">One of my largest concerns is feeling like I am not good enough for the program and it is making writing my application difficult. What was your process for writing your application and what did you highlight that made you a stand out.Â </h3>\n<div>Â </div>\n<div>I appreciate your honesty and directness. Trust me you are not alone. Even those who receive a Fulbright wonder how they got it.</div>\n<div>Â </div>\n<div>Focus on what you are passionate about and build a story around it. For example, I began with a little story about the small \"businesses\" I started as a kid (lemonade/crafts/lawncare) and how that tied into what I wanted to do with my career....and more importantly why the Fulbright was the best opportunity to achieve those career goals. Passion, competency, and a bit of blissful ignorance about the competition can make a great start to an application.</div>\n<div>Â </div>\n<div>Be prepared to revise your application A LOT. I revised my application countless times with aÂ <a href=\"https://us.fulbrightonline.org/fulbright-program-advisers\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://us.fulbrightonline.org/fulbright-program-advisers&amp;source=gmail&amp;ust=1596749895805000&amp;usg=AFQjCNFLK8qrtILhkrd_aNSUHi0isfd9tw\" rel=\"noopener\">Fulbright Program Advisor</a>Â (may want to check in with your undergrad university, unless you are applying \"at-large\"). I also did not get the Fulbright the first time I applied for it. I know a few others have the same story.</div>\n<div>Â </div>\n<div>Definitely check out some of theÂ <a href=\"https://us.fulbrightonline.org/resources/recorded-webinars\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://us.fulbrightonline.org/resources/recorded-webinars&amp;source=gmail&amp;ust=1596749895805000&amp;usg=AFQjCNEE4zvvI-YtDz8oKh5uxn30A72q3g\" rel=\"noopener\">Fulbright webinars</a>Â on application content. They often have Fulbright alumni talk about their applications.</div>\n<h3 id=\"mcetoc_1ef3d7n9836h\">Have you encountered any positives or negatives aboutÂ pursuing and receivingÂ a Master's degree abroad, as opposed to staying within the U.S.?Â </h3>\n<p>Outside of Oxford and Cambridge (and maybe London School of Economics), I have found that there is very little name recognition for other globally ranked universities across the American business world (the opposite is true for the academic world). Ultimately, there is immense value in getting a Master's degree abroad from a well ranked university. Given the opportunity to redo everything, I would quickly pick the Fulbright and UCL degree over a Harvard MBA any day.</p>\n<h3 id=\"mcetoc_1ef3d7n9836i\">Did you talk about specificÂ courses or professors that interested you within the program?Â </h3>\n<p>Yes! Including this can help you to answer the question - [Why do you need to do this research/degree in this country at this university?] The MSc. Entrepreneurship at UCL is quite special because it essentially acts as a talent incubator. The program is set up to help students start and grow scalable companies, which was a core proposal in my SOGP. This is quite different from how MIT or Harvard structure their MBA programs. So, it offered a clear reason why UCL was one of the best, if not the best place, to pursue my goals.</p>\n<h3 id=\"mcetoc_1ef3d7n9836j\">Did you specify in your Statement of Grant Purpose yourÂ intended dissertation on public transportation, or was that something you developed while studying at UCL?</h3>\n<p>Great question. I actually proposed another project in my SOGP focused on building a decentralized, crowd-sourced emergency response service. However, my focus changed to the rail industry quite quickly once I started classes and assessed my opportunities. For an MSc. in Entrepreneurship this is somewhat normal (to pivot). However, for more technical degrees it is more uncommon to drastically deviate from your SOGP proposal.</p>\n<h3 id=\"mcetoc_1ef3d7n9836k\">In what ways did London add or detract from your experience at UCL?Â </h3>\n<p>I think London is one of the best cities to get an MBA or any other graduate business degree. The access to people, companies, and money is unrivaled by most other cities in the world. A major downside of living in London is cost. I practiced frugality the majority of my time while Fulbright peers in other UK cities (and other countries) were not as concerned on budgeting based on my personal experience.</p>\n<h3 id=\"mcetoc_1efkjrb1u1q\">For Host Country Engagement, did you focus on ways to get involved within the UCL campus or with London in general? In what ways did you end up engaging with the community?Â </h3>\n<p>There are two main points that need to be made in the Host Country Engagement response.</p>\n<ol>\n<li>How will you act as an ambassador outside of your research/studies?</li>\n<li>How will you develop a support structure to cope with difficult circumstances?</li>\n</ol>\n<p>From my experience, I think some of the best strategies rely on engaging through your passions/interests whether that is sport, music, art, food, etc. That could take the form of being involved with UCL or University of London student groups, however it could also take almost any other form. London is special because the opportunities are seemingly endless and a community can be found for even the most esoteric interests.</p>\n<p>Again, I think the MSc. Entrepreneurship is a bit different because of the networking requirements of the program itself. I spent what felt like a majority of my time meeting with local entrepreneurs, engineers, designers, and investors. I also participated in hackathons and coding challenges. I think I originally proposed getting involved in a football club and volunteering at a local community kitchen, but my schedule prevented me from doing either of those things.</p>\n<h3 id=\"mcetoc_1efkjrb1u1r\">Any other tips or tricks?</h3>\n<ol>\n<li>Start early (6-7 months).</li>\n<li>Revise, revise, revise!</li>\n<li>Stay strong even when success seems unlikely.</li>\n</ol>\n<p>I did not start the application process with extremely concrete and succinct ideas of why I wanted to pursue a Fulbright Award. While I was fortunate to intern abroad at engineering companies in Seoul and Bangalore, I spent much of my undergraduate career with my nose in an engineering textbook or prepping for an exam. I did not take enough time to really think about and plan my 5/10 years goals. The application process really helped me to slow down and carefully think about myself and my goals, which really required months of time to solidify.</p>\n<p>I did not get the Fulbright Award the first time I applied because I bombed the UK Commission interview. However, by that point I already convinced myself that the Fulbright-UCL Award really was the perfect opportunity. I applied again, gained better insight into the interview, and was fortunate to receive the award the second time.</p>\n<h3 id=\"mcetoc_1ef3dcr3036m\">General Thoughts</h3>\n<ol>\n<li>Describing the distinctions in your field between the U.S. and U.K. shows competence and effort. If you can describe, as you just did, whyÂ  Kent is the best place to achieve your career goals (or follow your interests) then this will greatly enhance the strength of the application.</li>\n<li>Being able to succinctly describe your field of interest to a group of laypeople while still maintaining the interest of experts is key. Your application will undergo at least two levels of review; the first by a selection committee that will most likely be familiar with your field and the second by the U.K. commission that will not be familiar with your field. If you can keep the reader's interest/respect then you can tie it in with your career goals and make them excited about the impact you could have in the world given the Fulbright.</li>\n<li>Being able to succinctly describe your field and interests also reflects on your communication capabilities, which in turn reflects on your ability to be a good cultural ambassador. For example, while in the UK you may find yourself trying to explain race inequality, firearms, politics, and police brutality more often than expected.</li>\n</ol>\n<p>Â </p>",
            "image": "https://blog.garrettdowd.com/media/posts/17/dc_crop.jpg",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Fulbright"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/why-food-sucks/",
            "url": "https://blog.garrettdowd.com/why-food-sucks/",
            "title": "Why Food Sucks",
            "summary": "Just a few generations ago my great grandparents tended to their family farm after immigrating to the United States from&hellip;",
            "content_html": "<p class=\"align-left\">Just a few generations ago my great grandparents tended to their family farm after immigrating to the United States from Poland. Back then, more than half of Americans were living in rural farming communities. These farmers grew a variety of crops and raised a variety of animals. Preservation techniques like fermentation, drying, and smoking were still common and had been passed between generations over thousands of years.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/9/farm-family-2.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/9/responsive/farm-family-2-xs.jpg 384w ,https://blog.garrettdowd.com/media/posts/9/responsive/farm-family-2-sm.jpg 600w ,https://blog.garrettdowd.com/media/posts/9/responsive/farm-family-2-md.jpg 768w ,https://blog.garrettdowd.com/media/posts/9/responsive/farm-family-2-lg.jpg 1200w\"  alt=\"\" width=\"323\" height=\"259\"></figure>\n<p>I never got to meet my great grandparents. I did not grow up plucking carrots from a field. I did not chase a chicken for dinner. I grew up eating fried lumps of ground chicken trimmings that were neatly packaged in a cardboard container and served with a side of flavored corn syrup sauce.</p>\n<p>There is growing criticism of the current industrialized food system. Chronic disease and ecological destruction follow in the wake of so called \"market demands\". Popular social opinion often points to one of many causes including overpopulation, food waste, or unchecked capitalism. The reality is more complicated.</p>\n<p>However, a number of visionaries are currently rethinking what our food system needs to look like in the next 20 years to meet population, health, and lifestyle demands. From vertical and shipping container farming to suburban permaculture oases, there are a number of efforts to re-balance the food system for the health of humans and the environment.</p>\n<p class=\"msg msg--success\">Hyper-local food production is a potential solution to many of the problems the plague our food system.</p>\n<p>Over the past year I have designed, engineered, and tested a personal food growing device for urban dwellers. I think this grow system should be available to everyone which is why I have <a href=\"https://github.com/garrettdowd/ufarm\" target=\"_blank\" rel=\"noopener noreferrer\">open-sourced the design on Github</a>. This is the first article in a three part series.</p>\n<ol>\n<li>Why Food Sucks | A Dangerously Short Overview of Industrialized Agriculture</li>\n<li><a href=\"https://blog.garrettdowd.com/the-future-of-food-is-hyper-local/\">The Future of Food is Hyper-local</a> | A Promising Vision for the Future of Agriculture</li>\n<li><a href=\"https://blog.garrettdowd.com/how-to-never-kill-another-plant/\">How to Never Kill another Plant</a> | Building a Personal Automated Nano Farm</li>\n</ol>\n<p>First, I find that most people I talk to, including my family, have little idea how food ends up on their plate or in their mouth. What problems have been created by agricultural industrialization and how does hyper-local food production attempt to solve them?</p>\n<h2>Consolidation of Agriculture</h2>\n<p>How many farmers do you know today? How many different sub species or cultivars of bananas have you eaten?</p>\n<p>Over the last century, industrialization has pushed the majority of food production into the hands of fewer and fewer farms which produce fewer and fewer varieties of plants and animals. According to <a href=\"https://www.ers.usda.gov/data-products/ag-and-food-statistics-charting-the-essentials/farming-and-farm-income/\" target=\"_blank\" rel=\"noopener noreferrer\">statistics from the USDA</a>, the number of farms in the U.S. has decreased from approximately seven million in 1935 to approximately two million today.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://www.ers.usda.gov/webdocs/Charts/58267/farms_fig01_9_2018_350px.png?v=5829.1\" data-is-external-image=\"true\"  alt=\"\" width=\"350\" height=\"279\"></figure>\n<p>There are still two million farms, which is more than you might expect. However, the centralization of production volume is another story. Ninety percent of farms only account for twenty percent of production. Large scale farms make up only three percent of farms, but account for forty-six percent of total production value.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://www.ers.usda.gov/webdocs/Charts/90817/farms_fig03Nov2019_350px.png?v=5829.1\" data-is-external-image=\"true\"  alt=\"\" width=\"350\" height=\"279\"></figure>\n<p><span style=\"text-decoration: underline;\">Yet, farms are not where the majority of power consolidation has occurred.</span> The alarming consolidation is in seed production where a handful of chemical and pharmaceutical corporations control the market for many crops. Corporations like Dow, DuPont, and Bayer (acquired Monsanto) sell seeds because they can (and do) make killer profits from selling pesticides and other complimentary chemical products. <a href=\"https://www.ers.usda.gov/publications/pub-details/?pubid=42531\" target=\"_blank\" rel=\"noopener noreferrer\">The USDA published a report in 2004</a> that details this consolidation. Similar analysis can be drawn for livestock production.</p>\n<p>The main point is that U.S. agriculture has consolidated to the point of concern, in my opinion. However, there is obviously more sides to the story. With consolidation comes optimization and the optimization is quite impressive.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://www.ers.usda.gov/webdocs/Charts/58283/farms_fig02_350px.png?v=2131.8\" data-is-external-image=\"true\"  alt=\"\" width=\"350\" height=\"279\"></figure>\n<p class=\"msg msg--info\">From an engineering perspective, industrial agriculture is an absolute marvel of modern process design, mechanization, and logistics.</p>\n<p>Hundreds of millions of people are being fed with a minimal amount of human time and effort. People can now spend more of their time on entertainment, relaxation, or investigating some of life's most interesting questions. Johns Hopkins has a great <a href=\"http://www.foodsystemprimer.org/food-production/industrialization-of-agriculture\" target=\"_blank\" rel=\"noopener noreferrer\">overview the industrialization of food production</a> and it effects including distribution and waste.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  style=\"font-size: 18.4px; outline: 3px solid rgba(var(--primary-color-rgb), 0.55)  !important;\" src=\"https://blog.garrettdowd.com/media/posts/9/soy-tractor-400x300.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/9/responsive/soy-tractor-400x300-xs.jpg 384w ,https://blog.garrettdowd.com/media/posts/9/responsive/soy-tractor-400x300-sm.jpg 600w ,https://blog.garrettdowd.com/media/posts/9/responsive/soy-tractor-400x300-md.jpg 768w ,https://blog.garrettdowd.com/media/posts/9/responsive/soy-tractor-400x300-lg.jpg 1200w\"  alt=\"\" width=\"355\" height=\"266\"></figure>\n<div>\n<div style=\"text-align: center;\">Â </div>\n<h2>Why Food Sucks</h2>\n<p>Again from a system and engineering point of view, food production is a process to be optimized to increase profit. This has led to plants/animals that are cultivated and engineered for</p>\n<ul>\n<li>high yield</li>\n<li>mechanized harvest</li>\n<li>transportation</li>\n<li>selling (tangible appearance and shelf life)</li>\n</ul>\n<p>While not inherently bad, these optimization variables have unintended consequences that result from incomplete scientific understanding and misaligned economic incentives. These consequences manifest in the form of</p>\n<ul>\n<li>mono-culture and reduced genetic variety</li>\n<li>chemical and pharmaceutical use</li>\n<li>food waste</li>\n<li>habitat destruction and desertification</li>\n<li>increased reliance on highly processed foods</li>\n</ul>\n<p>Each of these topics are a book, or a series of book unto themselves. References will be added at the end of this articles as my time allows. The main point is that</p>\n<p class=\"msg msg--warning\">Food is at the heart of many modern crises including chronic disease and environmental destruction. Systemic changes to food production and consumption are needed.</p>\n<h2>How to Make Food Not Suck</h2>\n<p>The good news is that we are in the middle of an agricultural revolution. There are startups working on a huge range of ideas;</p>\n<ul>\n<li>creating meat/protein alternatives</li>\n<li>using crops for carbon capture and storage</li>\n<li>reducing chemical use by surveying with drone and satellite imagery</li>\n<li>creating more efficient food marketplaces</li>\n</ul>\n<p><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">Some of these efforts seek to make the current system work better while others are on a quest of systemic disruption. One such systemic disrupter is the growing field of hydroponics and the business model of hyper-local produce production. Hydroponics, also known in the U.S. as soilless culture, is enabling food producers to grow food closer to where it is consumed, all while using less resources and pesticides.</span></p>\n</div>\n<div>Â </div>\n<div>In part two of this series, <a href=\"https://blog.garrettdowd.com/the-future-of-food-is-hyper-local/\">The Future of Food is Hyper-local</a> | A Promising Vision for the Future of Agriculture, I delve into the proposed benefits of hyper-local food production and the science behind it.</div>\n<div>Â </div>\n<div><a href=\"https://blog.garrettdowd.com/the-future-of-food-is-hyper-local/\" class=\"btn\">Part 2</a></div>\n<div>Â </div>\n<div>Updates:</div>\n<div>02/09/2020 - Added USDA statistics and resources on agricultural consolidation</div>\n<div>Â </div>",
            "image": "https://blog.garrettdowd.com/media/posts/9/Annotation-2020-08-27-182252.png",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Food"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/hyperlooptt/",
            "url": "https://blog.garrettdowd.com/hyperlooptt/",
            "title": "HyperloopTT",
            "summary": "If you haven't had a chance to read the article on Glyde, now is your chance. My journey with HyperloopTT&hellip;",
            "content_html": "<p>If you haven't had a chance to read the article on <a href=\"https://blog.garrettdowd.com/glyde/\">Glyde</a>, now is your chance. My journey with <a href=\"https://www.hyperlooptt.com/\" target=\"_blank\" rel=\"noopener noreferrer\">HyperloopTT</a> began while pitching Flexrail at <a href=\"https://ff.co/\" target=\"_blank\" rel=\"noopener noreferrer\">Founders Forum</a>, the premier conference for founders and CEOs in Europe.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/6/Annotation-2020-07-13-151941.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/6/responsive/Annotation-2020-07-13-151941-xs.png 384w ,https://blog.garrettdowd.com/media/posts/6/responsive/Annotation-2020-07-13-151941-sm.png 600w ,https://blog.garrettdowd.com/media/posts/6/responsive/Annotation-2020-07-13-151941-md.png 768w ,https://blog.garrettdowd.com/media/posts/6/responsive/Annotation-2020-07-13-151941-lg.png 1200w\"  alt=\"\" width=\"615\" height=\"317\"></figure>\n<p>At FF, I met Bibop Gresta, founder and former chairman of HyperloopTT. He charismatically criticized the rail industry while painting a picture of how Flexrail could pivot to a new industry. Somehow my work with HyperloopTT developed quickly in the following months and Flexrail began to pivot into Glyde.Â </p>\n<p>I started on a crypto-currency project using Glyde as a blueprint to build a utility strategy for a new crypto-currency. I <strong>delivered a whitepaper</strong> to executive leadership and worked with them directly on strategy until the project was cancelled. After the crypto-currency project I continued to collaborate with exec leadership across a range of topics.</p>\n<div class=\"gallery-wrapper gallery-wrapper--wide\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/6/gallery/IMG_4136.JPG\" data-size=\"1172x879\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/6/gallery/IMG_4136-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>London</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/6/gallery/5c42d560-2092-4a60-8bb8-06b1b0431605.jpg\" data-size=\"1172x879\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/6/gallery/5c42d560-2092-4a60-8bb8-06b1b0431605-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Dubai</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/6/gallery/18980de5-1039-4f64-bc9d-f3a421aae763.jpg\" data-size=\"1024x768\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/6/gallery/18980de5-1039-4f64-bc9d-f3a421aae763-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Belo Horizonte, Brazil</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/6/gallery/IMG_4031.jpg\" data-size=\"1172x879\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/6/gallery/IMG_4031-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Cleveland, Ohio</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/6/gallery/IMG_4035.JPG\" data-size=\"960x720\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/6/gallery/IMG_4035-thumbnail.JPG\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Cleveland, Ohio</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/6/gallery/599ab9a8-cbdb-4f23-a637-2ff2889d6e40.jpg\" data-size=\"1172x879\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/6/gallery/599ab9a8-cbdb-4f23-a637-2ff2889d6e40-thumbnail.jpg\" alt=\"\" width=\"768\" height=\"576\"></a>\n<figcaption>Los Angeles</figcaption>\n</figure>\n</div></div>\n<p>Overall, I worked with HyperloopTT across 4 continents developing strategy and working with stakeholders. The pictures above are from a few of those experiences.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/6/557fcdd0-ce03-4b1b-9fdb-a15bf1ba0a5e.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/6/responsive/557fcdd0-ce03-4b1b-9fdb-a15bf1ba0a5e-xs.jpg 384w ,https://blog.garrettdowd.com/media/posts/6/responsive/557fcdd0-ce03-4b1b-9fdb-a15bf1ba0a5e-sm.jpg 600w ,https://blog.garrettdowd.com/media/posts/6/responsive/557fcdd0-ce03-4b1b-9fdb-a15bf1ba0a5e-md.jpg 768w ,https://blog.garrettdowd.com/media/posts/6/responsive/557fcdd0-ce03-4b1b-9fdb-a15bf1ba0a5e-lg.jpg 1200w\"  alt=\"\" width=\"903\" height=\"677\"></figure>\n<p class=\"msg--highlight  msg--info msg\">However, it is important to point out that HyperloopTT is not an average startup. <a href=\"https://www.hbs.edu/faculty/Pages/item.aspx?num=52627\" target=\"_blank\" rel=\"noopener noreferrer\">Harvard Business School developed a case study</a> around HyperloopTT's business model. To summarize, Hyperloop has only a handful of full-time employees and instead utilizes a large group (800+) of contributors and partner companies to achieve business goals. These contributors and partners receive future equity in exchange for their work. I was one of these contributors and my involvement was part-time.Â </p>",
            "image": "https://blog.garrettdowd.com/media/posts/6/HyperloopTT-capsule.jpg",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Transportation",
                   "Product Management"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/glyde/",
            "url": "https://blog.garrettdowd.com/glyde/",
            "title": "Glyde | Designing Better Pricing",
            "summary": "Glyde is a new type of dynamic pricing for transportation. So new that we created a new name for it,&hellip;",
            "content_html": "<p class=\"msg msg--success\">Glyde is a new type of dynamic pricing for transportation. So new that we created a new name for it, flex pricing. I was the lead product manager and founder of Glyde and this is a quick story about it.</p>\n<h2>Â </h2>\n<h2><span style=\"text-decoration: underline;\"><strong>Dynamic pricing.</strong></span><strong> ðŸ˜¬</strong></h2>\n<p>If you are already familiar with dynamic pricing then you can skip the next section. If not, don't worry. I removed any differential equations and confusing economic notation.</p>\n<p>What thoughts does \"dynamic pricing\" bring to mind? Uber surge pricing? Airline tickets? Dynamic pricing has a fairly negative connotation. However, in the age of big data and free capitalism, it is lauded as a technique the promises max yield and utilization of assets. The largest ticketing company for travel is Amadeus, a company worth 40 billion USD in 2018. Originally founded by major European airlines, it now owns the majority of the airline ticketing business and is a prominent purveyor of dynamic pricing.</p>\n<p>There are countless guides on the internet describing how to fight back against dynamic pricing systems. While Amadeus does not publish what data their algorithms use, it is probable they use a combination of personal and system information. <a href=\"https://amadeus.com/en/portfolio/airlines/dynamic-pricing\" target=\"_blank\" rel=\"noopener noreferrer\">Their dynamic pricing website </a>states, <em>\"Analyze flight offers that customers have previously seen and bought, in order to model future shopping behavior and calculate passengersâ€™ willingness to pay - in real-time. Offer the right price for a shopping session and hit the optimal 'sweet spot' between raising the price to make more money per seat and lowering the price to increase the probability of the customer picking your offer.\" </em>In industry speak, this is called optimizing <strong>loading</strong> and <strong>yield</strong>. <span style=\"text-decoration: underline;\">Loading</span> is a measure of asset utilization (a.k.a. Are there empty seats?) and <span style=\"text-decoration: underline;\">yield</span> is a measure of revenue or profitability per customer. Balancing loading and yield to maximize total revenue is the name of the game and roughly <strong>\"loading * yield = total revenue</strong>\". I'm sorry if you weren't expecting a deep dive on dynamic pricing, but we need to go one step deeper.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://www.economicshelp.org/wp-content/uploads/2019/06/dynamic-pricing.jpg\" data-is-external-image=\"true\"  alt=\"\" width=\"519\" height=\"260\"></figure>\n<p>The reality is that loading and yield are somewhat inversely related. Higher ticket prices means that fewer people are willing to purchase a ticket at that price and vice versa. This is commonly referred to as <strong>price sensitivity</strong>. A good example of price insensitive customers are business travelers, who have travel requirements regardless of price. The challenge of dynamic pricing is to charge price insensitive customers a premium price (increase yield) while still attracting price sensitive customers with a discount price (increase loading). Traditional dynamic pricing tries to predict a customer's price sensitivity and overall market demand to set a unique ticket price for each [potential] customer. That's it. It's a simple economic idea that is quite complex at scale.</p>\n<p>The reality is that these algorithms often use personal data that is either collected from web interactions or purchased from third parties to make price sensitivity predictions. Furthermore, I think there are valid ethical concerns of applying dynamic pricing techniques to essential services such as transportation. For example, do you think traditional dynamic pricing should be used in healthcare? So what is the alternative?...</p>\n<p class=\"msg msg--highlight \">How do you set prices and ensure public assets or essential services, like a rail network, are being efficiently used by the public?Â </p>\n<p>Â </p>\n<h2>Glyde.</h2>\n<p>As we learned in the last section, dynamic pricing is a technique to increase total revenue by optimizing <em>loading</em> and <em>yield</em>. At the heart of dynamic pricing is <span style=\"text-decoration: underline;\"><em>price sensitivity</em></span><strong>, </strong>which is what dynamic pricing algorithms try to predict.</p>\n<p class=\"msg msg--highlight \">But what if there was a mechanism that <em>removed the need to predict price sensitivity</em>? <em><strong>What if a customer would willingly divulge their price sensitivity</strong></em>... to their ultimate benefit? This is the question at the core of Glyde.</p>\n<h3>Â </h3>\n<h3>In The Beginning ðŸš†</h3>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  style=\"outline: 3px solid rgba(var(--primary-color-rgb), 0.55)  !important;\" src=\"https://blog.garrettdowd.com/media/posts/5/Annotation-2020-07-10-213739.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-10-213739-xs.png 384w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-10-213739-sm.png 600w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-10-213739-md.png 768w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-10-213739-lg.png 1200w\"  alt=\"\" width=\"449\" height=\"122\"></figure>\n<p>Glyde was born as <span style=\"text-decoration: underline;\"><strong>Flexrail</strong></span> from Hacktrain 3.0, the premier rail industry hackathon in Europe and possibly the best overall hackathon... ever. Hacktrain 3.0 was a 48-hour marathon that took place on moving trains across Europe with stops across 9 different venues. <a href=\"https://www.silverrailtech.com/hacktrain-an-inside-persepective/\" target=\"_blank\" rel=\"noopener noreferrer\">Here is a written account of the event</a> from they folks at SilverRail. Or better yet, watch the official video below.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/f8AxokvfcX0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>If the video didn't already spoil it, Flexrail placed first in the competition. I was the team lead and pitched the product at the finals.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/5/IMG_7562.JPG\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/5/responsive/IMG_7562-xs.JPG 384w ,https://blog.garrettdowd.com/media/posts/5/responsive/IMG_7562-sm.JPG 600w ,https://blog.garrettdowd.com/media/posts/5/responsive/IMG_7562-md.JPG 768w ,https://blog.garrettdowd.com/media/posts/5/responsive/IMG_7562-lg.JPG 1200w\"  alt=\"\" width=\"518\" height=\"291\"></figure>\n<p>Hacktrain was not the only success. I won additional entrepreneurial awards and competitions including UCL Bright Ideas and FFactor. FFactor allowed me to pitch Flexrail at the lauded Founder's Forum in front of founders, CEOs and even Prince Harry and David Cameron. Founder's Forum is also where I met Bibop Gresta, Founder and Chairman of HyperloopTT, but that is saved for another post.</p>\n<h3>Â </h3>\n<h3>The Flex Ticket ðŸ°</h3>\n<p class=\"msg msg--success\">So why did Flexrail win so many awards?</p>\n<p>Let's start with the Flex Ticket. The Flex Ticket enables customers to trade travel flexibility for discounted tickets. Ultimately, this allows rail operators to offer discounted tickets targeted at price sensitive customers with little risk of losing yield on price insensitive customers.</p>\n<p>Let's compare the Flex Ticket experience to a traditional ticketing experience provided by Trainline, a leading rail ticketing platform in the UK.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/5/Trainline-Pricing.gif\" alt=\"Traditional Booking Experience\" width=\"241\" height=\"429\">\n<figcaption >Traditional Booking Experience</figcaption>\n</figure>\n<p>The traditional ticketing experience shows a large number of ticket options to travel between London and Manchester. Users must scroll through all the listing to find the cheapest ticket that matches their travel requirements. The same tickets are also shown to every customer so traditional pricing techniques are employed to charge higher prices for services that are predicted to be more heavily used or of higher value.</p>\n<p class=\"msg msg--warning\"><em>Note: There are many nuances to the way ticket prices are set, which is the result of a complex relationship between the government that owns to the infrastructure and the rail franchises that operate services on the network. More on this later</em></p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/5/Flexrail-Pricing.gif\" alt=\"Flexrail Booking Experience\" width=\"243\" height=\"431\">\n<figcaption >Flexrail Booking Experience</figcaption>\n</figure>\n<p>Unlike traditional ticketing, the Flex Ticket experience is a two step process.</p>\n<ol>\n<li>The user picks a Travel Window (time window during which they are willing to travel) in advance of their travel date/time and are given an immediate price. This makes the flexibility/price trade-off completely transparent. They are issued a Flex Ticket which is a promise for a ticket during their selected Travel Window.</li>\n<li>Closer to the travel date/time, the user is issued a ticket for a specific train/time within their Time Window. Exactly when the user is issued a specific train/time depends on the rail operators pricing strategy.</li>\n</ol>\n<p>So the main concept of a Flex Ticket is that customers are trading the certainty of their travel time for a price discount. This notion fits fairly well with existing economic theory. The more interesting insight is that the most price sensitive customer select the largest Travel Window.Â </p>\n<p class=\"msg msg--success\">Price sensitivity = Flexibility = Time = $<span class=\"LrzXr kno-fv\">Â£</span>â€Žâ‚¬</p>\n<p>Better yet, there is a near perfect linear correlation between price sensitivity and travel flexibility confirmed by over 150 user interviews. This is the roux of the secret sauce that powered Flexrail's algorithms.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/5/Annotation-2020-07-13-133336.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-13-133336-xs.png 384w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-13-133336-sm.png 600w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-13-133336-md.png 768w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-13-133336-lg.png 1200w\"  alt=\"\" width=\"456\" height=\"390\"></figure>\n<p>But Wait. There's More.</p>\n<p>Â </p>\n<h4>Dynamic Load Factor Smoothing (DLFS)</h4>\n<p>The Flex Ticket mechanism allowed Flexrail to optimize the loading of high frequency services.Â </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/5/Annotation-2020-07-13-143126.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-13-143126-xs.png 384w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-13-143126-sm.png 600w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-13-143126-md.png 768w ,https://blog.garrettdowd.com/media/posts/5/responsive/Annotation-2020-07-13-143126-lg.png 1200w\"  alt=\"\"></figure>\n<p>Using historical and real-time ticketing data I built a prediction model to estimate future loading over an arbitrary time-span. This allowed Flexrail's algorithms to assign Flex Ticket holders to trains predicted to be less full. It is important to note that the predictions have accuracy limitations and only Flex Tickets can be optimally assigned. This means that DLFS will not solve problems like <em>peak loading</em> for certain commuter routes. However, there are industries other than transportation where DLFS is much more useful such as theme parks.</p>\n<p>Â </p>\n<h3>Why Flexrail Ultimately Failed</h3>\n<p>Rail markets are complex and slow moving monoliths. Unlike rail markets in countries where the entire rail system is nationalized, the UK rail market is partially privatized. The government, Network Rail, owns the infrastructure but does not operate any services. Private companies compete for \"franchises\" to operate a defined service or route. The franchises are defined with extreme detail and give private companies little flexibility to deviate from the franchise contract.</p>\n<p>In fact, the amount of money that a private company makes from a rail franchise is stipulated in the contract. Any extra profit the franchise makes must be given back to the government. Ticket types and prices are also regulated by the government to varying degrees.Â </p>\n<p>These factors combined with the personal challenges of living abroad in London led to the eventual spin-down of the Flexrail business efforts.</p>\n<p>However, this was the beginning of Glyde, a pivot away from the rail industry. A pivot that allowed me to work around the world with some amazing people. Read more about this in my article on <a href=\"https://blog.garrettdowd.com/hyperlooptt/\">HyperloopTT.</a></p>",
            "image": "https://blog.garrettdowd.com/media/posts/5/glyde.png",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Transportation",
                   "Product Management"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        },
        {
            "id": "https://blog.garrettdowd.com/imods-apple-ios-challenger/",
            "url": "https://blog.garrettdowd.com/imods-apple-ios-challenger/",
            "title": "iMods | Challenging Apple &amp; iOS",
            "summary": "A great smartphone makes tasks simpler and easier. Apple is famous for creating simple devices that make our lives easier,&hellip;",
            "content_html": "<blockquote>\n<p><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">A great smartphone makes tasks simpler and easier. Apple is famous for creating simple devices that make our lives easier, but with 300+ million users is a one-size-fits-all approach really that simple anymore? - iMods Pitch 2014</span></p>\n</blockquote>\n<h2>Intro</h2>\n<p>Apple has historically locked down the iOS operating system and the App Store to prevent users and developers from modifying/adding core features and UI/UX. This is especially true when compared to a mobile OS like Android. However, this did not stop tech nerds/geniuses/gods from \"hacking\" iOS, using techniques like code injection, to overcome Apple imposed limitations.</p>\n<p>In fact, many features that we could not live without in current versions of iOS like cellular hotspot, mission control, notification center, in-app messaging, and more <strong>were all originally created and </strong><span style=\"font-size: 18.4px;\"><strong>released</strong></span><strong> by these tech/design geniuses </strong>within the so-called <a href=\"https://en.wikipedia.org/wiki/IOS_jailbreaking\" target=\"_blank\" rel=\"noopener noreferrer\">jailbreak </a>community. In another manner of saying, Apple mimicked (ripped-off) many of the features and UI/UX enhancements developed by the jailbreak community.</p>\n<p>Even Apple founder and tech god Steve Wozniak was a fan,</p>\n<blockquote>\n<p>I have always given my support to the jailbreak community because they remind me of myself when I met Steve Jobs and how we were, then and for the years leading to Apple. <em>-Steve Wozniak</em></p>\n</blockquote>\n<p>iMods was born from this \"jailbreak\" community back in 2014. It was an ambitious attempt to modularize and appify iOS using jailbreak software as the building blocks. iMods was an attempt to solve two major problems with Cydia, the existing jailbreak marketplace at the time.</p>\n<ul>\n<li>Piracy. Cydia enabled rampant piracy, hindering talented developers efforts.Â </li>\n<li>Usability. Understanding how to jailbreak an iOS device and what software was safe to install was a high barrier to entry.Â </li>\n</ul>\n<p>We created an App Store like marketplace that enabled an average iOS user to <strong>easily</strong> install <strong>vetted</strong> enhancements on their iOS devices.</p>\n<p>Again, in the words of Steve Wozniak,</p>\n<blockquote>\n<p>Â I think it's a great thing...to make the software work exactly the way they need it to. That kind of hacking is the center of my heart, that's who I am. - Steve Wozniak</p>\n</blockquote>\n<p class=\"msg msg--success\"><strong>This was iMods.</strong></p>\n<h2>iMods</h2>\n<p>I joined iMods as a co-founder and product manager in 2014. The majority of the team worked remotely and were located around the world from Greece to California. We also had an angel-investor that provided a group of local developers.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.garrettdowd.com/media/posts/4/Picture1.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.garrettdowd.com/media/posts/4/responsive/Picture1-xs.png 384w ,https://blog.garrettdowd.com/media/posts/4/responsive/Picture1-sm.png 600w ,https://blog.garrettdowd.com/media/posts/4/responsive/Picture1-md.png 768w ,https://blog.garrettdowd.com/media/posts/4/responsive/Picture1-lg.png 1200w\"  alt=\"\" width=\"182\" height=\"371\"></figure>\n<p>So instead of telling you about iMods let me just show you. The following image gallery details the original user interface mockups.</p>\n<div class=\"gallery-wrapper gallery-wrapper--wide\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"6\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/Login.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/Login-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397410598.97_1344666.jpg\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397410598.97_1344666-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397410694.93_1345494.jpg\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397410694.93_1345494-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397410698.44_1345495.jpg\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397410698.44_1345495-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390828.4_1344665.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390828.4_1344665-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390828.54_1344669.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390828.54_1344669-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390828.42_1344667.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390828.42_1344667-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390828.52_1344668.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390828.52_1344668-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397412253.77_1345496.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397412253.77_1345496-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397412293.43_1345532.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397412293.43_1345532-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418314.38_1346097.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418314.38_1346097-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390631.56_1342513.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397390631.56_1342513-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418314.42_1346099.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418314.42_1346099-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418314.45_1346098.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418314.45_1346098-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418321.66_1346096.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418321.66_1346096-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418324.9_1344847.jpg\" data-size=\"x\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/1397418324.9_1344847-thumbnail.jpg\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n</div></div>\n<p>And here are a few screenshots from an early version of the app running in the XCode simulator.</p>\n<div class=\"gallery-wrapper gallery-wrapper--wide\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"4\">\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3418.png\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3418-thumbnail.png\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3419.png\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3419-thumbnail.png\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3421.png\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3421-thumbnail.png\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3422.png\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3422-thumbnail.png\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3423.png\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3423-thumbnail.png\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3424.png\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3424-thumbnail.png\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3426.png\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3426-thumbnail.png\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3429.png\" data-size=\"640x1136\"><img loading=\"lazy\" src=\"https://blog.garrettdowd.com/media/posts/4/gallery/IMG_3429-thumbnail.png\" alt=\"\" width=\"640\" height=\"1136\"></a></figure>\n</div></div>\n<p>We did a few things really well. User interface and community engagement were at the top of our accomplishments with buy-in from top developers and viral popularity from users. Here is a teaser video showcasing some of the software available on iMods.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/6BWY0-zIVY8\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>There were also many technical accomplishments from a custom package manager to a scalable backend system (payment, account, support, marketing).</p>\n<p>iMods was released under GPL3 on Github a couple years after the startup ceased to function. It can be <a href=\"https://github.com/iMods1/iMods\" target=\"_blank\" rel=\"noopener noreferrer\">found here</a>.</p>",
            "image": "https://blog.garrettdowd.com/media/posts/4/iMods-Logo-Blue.png",
            "author": {
                "name": "Garrett Dowd"
            },
            "tags": [
                   "Product Management"
            ],
            "date_published": "2020-09-08T12:46:46-04:00",
            "date_modified": "2020-09-08T12:46:46-04:00"
        }
    ]
}
